{
  "appName": {
    "message": "Decodificador e Codificador de Esteganografia"
  },
  "shortDesc": {
    "message": "Use o aplicativo Decodificador e Codificador de Esteganografia para incorporar ou extrair metadados de imagens, descriptografar esteganografia em png, bmp, jpg."
  },
  "storeDesc": {
    "message": "Precisa extrair mensagens secretas escondidas dentro de imagens que parecem completamente normais e cujo conteúdo oculto não é visível? Este aplicativo de decodificador e codificador de esteganografia ajuda você a decodificar esteganografia em imagens em segundos, diretamente no seu navegador. Ele funciona como um decodificador de esteganografia para png/bmp/jpg/jpeg, permitindo que você extraia metadados e mensagens esteganográficas ocultas de capturas de tela, memes ou imagens de teste sem instalar ferramentas pesadas de esteganografia. Além disso, você pode incorporar dados secretos invisíveis dentro de uma imagem.\n\n✅ O que você pode fazer\n• extrair metadados da imagem\n• revelar imagens dentro de imagens\n• descriptografar esteganografia de arquivos de mídia\n• decodificar esteganografia em diferentes formatos\n• extrair informações ocultas dos pixels\n• incorporar mensagens esteganográficas secretas de volta\n• ocultar texto em imagens com esteganografia LSB\n• codificar mensagem em arquivo de mídia para compartilhamento privado\n\n📌 Formatos suportados incluem\n- decodificador stegano png\n- decodificador stegano bmp\n- decodificador stegano jpg/jpeg\n\nComo decodificar (guia rápido)\n1️⃣ Arraste um PNG/BMP/JPG/JPEG para o decodificador de esteganografia\n2️⃣ Ele analisa automaticamente as fotos, extrai metadados e descriptografa a esteganografia\n3️⃣ Se necessário, execute novamente após salvar uma cópia limpa\n\nComo codificar (guia rápido)\n1️⃣ Digite seu texto ou cole os dados\n2️⃣ Escolha uma imagem PNG ou BMP\n3️⃣ Clique em incorporar e salve seu novo arquivo\n4️⃣ Envie como uma imagem normal\n\n🧩 Para quem é isso\n▸ estudantes aprendendo a decodificar esteganografia e os fundamentos do LSB\n▸ criadores que desejam ocultar mensagens em png/bmp/jpg/jpeg\n▸ desenvolvedores testando rapidamente uma ferramenta de esteganografia de imagem\n▸ jogadores de CTF que precisam descriptografar dicas de esteganografia\n▸ entusiastas de esteganografia\n\nPor que as pessoas usam este software de esteganografia\n➤ verificações rápidas em chats, fóruns ou pesquisas\n➤ uma ferramenta de esteganografia limpa que permanece leve\n➤ uma combinação prática de decodificador e codificador esteganográfico\n➤ útil quando você precisa extrair segredos e validar arquivos\n\n💡 Como funciona a esteganografia LSB (Least Significant Bit)\nLSB modifica os bits menos significativos dos valores de cor dos pixels para incorporar uma carga secreta. Como esses bits têm impacto visual mínimo, a foto parece inalterada ao olho humano. Nossa ferramenta de esteganografia processa arquivos pixel por pixel, lendo ou escrevendo dados nos bits menos significativos dos canais RGB. Este método é particularmente eficaz com formatos PNG e BMP porque utilizam compressão sem perdas, preservando os valores exatos dos pixels necessários para uma codificação e decodificação de esteganografia confiável.\n\n🔒 Mentalidade de privacidade\nA extensão Decodificador e Codificador de Esteganografia não compartilha, salva ou envia nenhum dos seus dados para lugar algum.\n\n📌 Métodos suportados\n\n1. decodificador de esteganografia png\n2. decodificador stegano bmp para bitmap\n3. lógica de decodificador stegano lsb para saída estável e repetível\n4. casos de uso de png stegano lsb para capturas de tela e ícones\n5. suporte esteganográfico para jpg/jpeg\n\n🛠️ Solução de problemas\n\n* use PNG/BMP original quando possível (recompressão pode quebrar o decodificador de imagem de esteganografia)\n* se a decodificação falhar, tente outra cópia do mesmo arquivo\n* mantenha as mensagens pequenas para uma codificação LSB estável\n* evite converter PNG para JPG antes de descriptografar o stego\n* compare as saídas ao decodificar png esteganográfico após a exportação\n\n⚡ Desempenho e limitações\nA extensão processa arquivos inteiramente no seu navegador usando APIs da Web, garantindo que seus arquivos nunca deixem seu dispositivo. Esse processamento local significa sem atrasos de upload, sem dependências de servidor e total privacidade. A velocidade de processamento depende do tamanho do arquivo—ícones pequenos decodificam em milissegundos, enquanto fotos de alta resolução podem levar alguns segundos. O método LSB tem um limite de capacidade: você pode tipicamente incorporar cerca de 1 byte de dados por 8 pixels em uma foto não comprimida. Para melhores resultados, use formatos de mídia não comprimidos e mantenha as mensagens incorporadas concisas. Lembre-se de que arquivos JPG usam compressão com perdas, o que pode corromper o conteúdo esteganográfico, portanto, são mais adequados para decodificar esteganografia existente do que para codificar novas mensagens.\n\nFAQ\nQ: Quais formatos este ferramenta de esteganografia suporta?\nA: Suportamos png, bmp, jpeg, jpg. Novos formatos podem ser adicionados no futuro.\n\nQ: Qual método a extensão usa?\nA: Ela se comporta como um decodificador de esteganografia lsb.\n\nQ: É online ou offline?\nA: Não requer conexão, então pode ser usada de ambas as maneiras.\n\nQ: Pode me ajudar a decodificar texto de mensagem oculta?\nA: Sim, arraste o arquivo para a extensão e ela extrairá informações ocultas se estiver disponível."
  }
}