{
  "appName": {
    "message": "Стеганографски декодер и енкодер"
  },
  "shortDesc": {
    "message": "Използвайте приложението за стеганографски декодер и енкодер, за да вградите или извлечете метаданни от изображение, да декриптирате стеганография в png, bmp, jpg."
  },
  "storeDesc": {
    "message": "Трябва да извлечете тайни съобщения, скрити в изображения, които изглеждат напълно нормални и скритото съдържание не е видимо? Това приложение за стеганографски декодер и енкодер помага да декодирате изображенческа стеганография за секунди, директно в браузъра си. То работи като декодер за стеганография на png/bmp/jpg/jpeg, така че можете да извлечете метаданни и скрити стеганографски съобщения от екранни снимки, мемета или тестови изображения, без да инсталирате тежки стеганографски инструменти. Освен това можете да вградите невидими тайни данни в изображение.\n\n✅ Какво можете да направите\n• извлечете метаданни от изображение\n• разкрийте изображения в изображения\n• декриптирайте стеганография от медийни файлове\n• декодирайте стеганография в различни формати\n• извлечете скрита информация от пиксели\n• вградете тайни стеганографски съобщения обратно\n• скрийте текст в снимки с LSB стеганография\n• кодирайте съобщение в медийния файл за частно споделяне\n\n📌 Поддържани формати включват\n- png стегано декодер\n- bmp стегано декодер\n- jpg/jpeg стегано декодер\n\nКак да декодирате (бързо ръководство)\n1️⃣ Пуснете PNG/BMP/JPG/JPEG в стеганографския декодер\n2️⃣ Той автоматично анализира снимките, извлича метаданни и декриптира стеганография\n3️⃣ Ако е необходимо, стартирайте отново след запазване на чиста копия\n\nКак да кодирате (бързо ръководство)\n1️⃣ Напишете текста си или поставете данни\n2️⃣ Изберете PNG или BMP изображение\n3️⃣ Кликнете върху вграждане и запазете новия файл\n4️⃣ Изпратете го като нормална снимка\n\n🧩 За кого е това\n▸ студенти, които учат основите на декодирането на стеганография и LSB\n▸ създатели, които искат да скрият съобщение в png/bmp/jpg/jpeg\n▸ разработчици, които бързо тестват инструмент за изображенческа стеганография\n▸ играчи на CTF, които трябва да декриптират стеганографски подсказки\n▸ ентусиасти на стеганография\n\nЗащо хората използват този софтуер за стеганография\n➤ бързи проверки в чатове, форуми или изследвания\n➤ чист стегано инструмент, който остава лек\n➤ удобен комбиниран декодер и енкодер за стеганография\n➤ полезен, когато трябва да извлечете тайни и да валидирате файлове\n\n💡 Как работи LSB (Least Significant Bit) стеганографията\nLSB модифицира най-малко значимите битове на стойностите на цветовете на пикселите, за да вгради тайно полезно натоварване. Тъй като тези битове имат минимално визуално въздействие, снимката изглежда непроменена за човешкото око. Нашият стег инструмент обработва файлове пиксел по пиксел, четейки или записвайки данни в най-малко значимите битове на RGB каналите. Този метод е особено ефективен с формати PNG и BMP, тъй като те използват без загуби компресия, запазвайки точните стойности на пикселите, необходими за надеждно кодиране и декодиране на стеганография. \n\n🔒 Настройка за поверителност\nРазширението Стеганографски декодер и енкодер не споделя, не запазва и не изпраща никакви ваши данни никъде.\n\n📌 Поддържани методи\n\n1. стеганографски декодер png\n2. bmp стегано декодер за битмап\n3. логика на lsb стегано декодер за стабилен, повторяем изход\n4. случаи на употреба на lsb стегано png за екранни снимки и икони\n5. поддръжка на стеганографски jpg/jpeg\n\n🛠️ Отстраняване на проблеми\n\n* използвайте оригинален PNG/BMP, когато е възможно (прекомпресията може да повреди декодера на стеганографски изображения)\n* ако декодирането не успее, опитайте с друга копия на същия файл\n* запазвайте съобщенията малки за стабилно LSB кодиране\n* избягвайте конвертирането на PNG в JPG преди да декриптирате стегото\n* сравнявайте изходите, когато декодирате стеганографски png след експортиране\n\n⚡ Производителност и ограничения\nРазширението обработва файлове изцяло в браузъра ви, използвайки Web APIs, което гарантира, че файловете ви никога не напускат устройството ви. Тази локална обработка означава без забавяния при качване, без зависимости от сървъри и пълна поверителност. Скоростта на обработка зависи от размера на файла - малките икони се декодират за милисекунди, докато снимките с висока резолюция могат да отнемат няколко секунди. Методът LSB има лимит на капацитета: обикновено можете да вградите около 1 байт данни на 8 пиксела в некомпресирана снимка. За най-добри резултати използвайте некомпресирани медийни формати и запазвайте вградените съобщения кратки. Запомнете, че JPG файловете използват компресия с загуби, което може да повреди стеганографското съдържание, така че те са по-подходящи за декодиране на съществуваща стеганография, отколкото за кодиране на нови съобщения.\n\nЧесто задавани въпроси\nВ: Какви формати поддържа този инструмент за стеганография?\nО: Поддържаме png, bmp, jpeg, jpg. Нови формати могат да бъдат добавени в бъдеще.\n\nВ: Кой метод използва разширението?\nО: То се държи като lsb стеганографски декодер.\n\nВ: Онлайн ли е или офлайн?\nО: Не изисква връзка, така че може да се използва по двата начина.\n\nВ: Може ли да ми помогне да декодирам скрит текст на съобщение?\nО: Да, пуснете файла в разширението и то ще извлече скритата информация, ако е налична."
  }
}