{
  "appName": {
    "message": "Decodificador i Codificador d'Esteganografia"
  },
  "shortDesc": {
    "message": "Utilitza l'aplicació de decodificador i codificador d'esteganografia LSB per incrustar o extreure metadades d'imatges, desxifrar esteganografia en png, bmp, jpg."
  },
  "storeDesc": {
    "message": "Necessites extreure missatges secrets amagats dins d'imatges que semblen completament normals i el contingut amagat no és visible? Aquesta aplicació de decodificador i codificador d'esteganografia lsb t'ajuda a decodificar l'esteganografia d'imatges en segons, directament al teu navegador. Funciona com un decodificador d'esteganografia d'imatges per a png/bmp/jpg/jpeg, així que pots extreure metadades i missatges esteganogràfics amagats de captures de pantalla, memes o imatges de prova sense instal·lar eines d'esteganografia pesades. A més, pots incrustar dades secretes invisibles dins d'una imatge.\n\n✅ Què pots fer\n• extreure metadades d'imatges\n• revelar imatges dins d'imatges\n• desxifrar esteganografia de fitxers multimèdia\n• decodificar esteganografia en diferents formats\n• extreure informació oculta dels píxels\n• incrustar missatges esteganogràfics secrets de nou\n• amagar text en imatges amb esteganografia LSB\n• codificar missatges en fitxers multimèdia per a compartir de manera privada\n\n📌 Formats compatibles inclouen\n- decodificador stegano png\n- decodificador stegano bmp\n- decodificador stegano jpg/jpeg\n\nCom decodificar (guia ràpida)\n1️⃣ Arrossega un PNG/BMP/JPG/JPEG al decodificador d'esteganografia\n2️⃣ Automàticament analitza les fotos, extreu metadades i desxifra l'esteganografia\n3️⃣ Si cal, torna a executar-ho després de desar una còpia neta\n\nCom codificar (guia ràpida)\n1️⃣ Escriu el teu text o enganxa dades\n2️⃣ Tria una imatge PNG o BMP\n3️⃣ Fes clic a incrustar i desa el teu nou fitxer\n4️⃣ Envia-ho com una imatge normal\n\n🧩 Per a qui és això\n▸ estudiants que aprenen a decodificar esteganografia i conceptes bàsics de LSB\n▸ creadors que volen amagar missatges en png/bmp/jpg/jpeg\n▸ desenvolupadors que proven ràpidament una eina d'esteganografia d'imatges\n▸ jugadors de CTF que necessiten desxifrar pistes d'esteganografia\n▸ entusiastes de l'esteganografia\n\nPer què la gent utilitza aquest programari d'esteganografia\n➤ comprovacions ràpides en xats, fòrums o investigacions\n➤ una eina stegano neta que es manté lleugera\n➤ una combinació útil de decodificador i codificador esteganogràfic\n➤ útil quan has d'extreure secrets i validar fitxers\n\n💡 Com funciona l'esteganografia LSB (Least Significant Bit)\nLSB modifica els bits menys significatius dels valors de color dels píxels per incrustar càrregues secretes. Com que aquests bits tenen un impacte visual mínim, la foto sembla inalterada a l'ull humà. La nostra eina steg processa fitxers píxel per píxel, llegint o escrivint dades en els bits menys significatius dels canals RGB. Aquest mètode és particularment efectiu amb formats PNG i BMP perquè utilitzen compressió sense pèrdues, preservant els valors exactes dels píxels necessaris per a una codificació i decodificació d'esteganografia fiable.\n\n🔒 Mentalitat de privadesa\nL'extensió Decodificador i Codificador d'Esteganografia no comparteix, desa ni envia cap de les teves dades enlloc.\n\n📌 Mètodes compatibles\n\n1. decodificador d'esteganografia png\n2. decodificador stegano bmp per a bitmap\n3. lògica de decodificador stegano lsb per a una sortida estable i repetible\n4. casos d'ús de png stegano lsb per a captures de pantalla i icones\n5. suport esteganogràfic jpg/jpeg\n\n🛠️ Solució de problemes\n\n* utilitza PNG/BMP originals quan sigui possible (la recompressió pot trencar el decodificador d'imatges d'esteganografia)\n* si la decodificació falla, prova una altra còpia del mateix fitxer\n* mantingues els missatges petits per a una codificació LSB estable\n* evita convertir PNG a JPG abans de desxifrar stego\n* compara sortides quan decodifiques png esteganogràfic després d'exportar\n\n⚡ Rendiment i limitacions\nL'extensió processa fitxers completament al teu navegador utilitzant Web APIs, assegurant que els teus fitxers mai abandonin el teu dispositiu. Aquest processament local significa que no hi ha retards d'upload, sense dependències de servidor i completa privadesa. La velocitat de processament depèn de la mida del fitxer: icones petites es decodifiquen en mil·lisegons, mentre que fotos d'alta resolució poden trigar uns segons. El mètode LSB té un límit de capacitat: normalment pots incrustar aproximadament 1 byte de dades per cada 8 píxels en una foto sense comprimir. Per obtenir els millors resultats, utilitza formats multimèdia sense comprimir i mantingues els missatges incrustats concisos. Recorda que els fitxers JPG utilitzen compressió amb pèrdues, la qual cosa pot corrompre el contingut esteganogràfic, així que són més adequats per a decodificar esteganografia existent que per a codificar nous missatges.\n\nFAQ\nQ: Quins formats suporta aquesta eina d'esteganografia?\nA: Donem suport a png, bmp, jpeg, jpg. Nous formats poden ser afegits en el futur.\n\nQ: Quin mètode utilitza l'extensió?\nA: Es comporta com un decodificador d'esteganografia lsb.\n\nQ: És en línia o fora de línia?\nA: No requereix connexió, així que es pot utilitzar de les dues maneres.\n\nQ: Pot ajudar-me a decodificar text de missatges amagats?\nA: Sí, arrossega el fitxer a l'extensió i extreurà informació oculta si està disponible."
  }
}