{
  "appName": {
    "message": "Steganografie Decoder & Encoder"
  },
  "shortDesc": {
    "message": "Gebruik de LSB afbeelding steganografie decoder & encoder app om metadata in een afbeelding in te voegen of te extraheren, en om steganografie in png, bmp, jpg te ontsleutelen."
  },
  "storeDesc": {
    "message": "Geheime berichten extraheren die verborgen zijn in afbeeldingen die er volkomen normaal uitzien en waarvan de verborgen inhoud niet zichtbaar is? Deze lsb steganografie decoder & encoder app helpt je om afbeeldingsteganografie in enkele seconden te decoderen, direct in je browser. Het werkt als een afbeelding steganografie decoder voor png/bmp/jpg/jpeg, zodat je metadata en verborgen steganografische berichten kunt extraheren uit screenshots, memes of testafbeeldingen zonder zware steganografie-tools te installeren. Bovendien kun je onzichtbare geheime gegevens in een afbeelding inbedden.\n\n✅ Wat je kunt doen\n• metadata uit afbeelding extraheren\n• afbeeldingen binnen afbeeldingen onthullen\n• steganografie uit mediabestanden decoderen\n• steganografie in verschillende formaten decoderen\n• verborgen informatie uit pixels extraheren\n• geheime steganografische berichten terug inbedden\n• tekst in afbeeldingen verbergen met LSB steganografie\n• bericht coderen in mediabestand voor privé delen\n\n📌 Ondersteunde formaten zijn onder andere\n- png stegano decoder\n- bmp stegano decoder\n- jpg/jpeg stegano decoder\n\nHoe te decoderen (snelle gids)\n1️⃣ Sleep een PNG/BMP/JPG/JPEG in de steganografie decoder\n2️⃣ Het parseert automatisch foto's, extrahert metadata en decodet steganografie\n3️⃣ Indien nodig, voer opnieuw uit na het opslaan van een schone kopie\n\nHoe te coderen (snelle gids)\n1️⃣ Typ je tekst of plak gegevens\n2️⃣ Kies een PNG of BMP afbeelding\n3️⃣ Klik op inbedden en sla je nieuwe bestand op\n4️⃣ Stuur het zoals een normale afbeelding\n\n🧩 Voor wie is dit\n▸ studenten die leren over steganografie decoderen en LSB-basisprincipes\n▸ makers die een bericht willen verbergen in png/bmp/jpg/jpeg\n▸ ontwikkelaars die snel een afbeelding steganografie-tool willen testen\n▸ CTF-spelers die steganografie-hints moeten decoderen\n▸ steganografie-enthousiastelingen\n\nWaarom mensen deze steganografie-software gebruiken\n➤ snelle controles in chats, forums of onderzoek\n➤ een schone stego-tool die lichtgewicht blijft\n➤ een handige steganografische decoder en encoder combo\n➤ nuttig wanneer je geheimen moet extraheren en bestanden moet valideren\n\n💡 Hoe LSB (Least Significant Bit) steganografie werkt\nLSB wijzigt de minst significante bits van pixelkleurwaarden om geheime payloads in te bedden. Aangezien deze bits minimale visuele impact hebben, lijkt de foto onveranderd voor het menselijke oog. Onze stego-tool verwerkt bestanden pixel voor pixel, leest of schrijft gegevens in de minst significante bits van de RGB-kanalen. Deze methode is bijzonder effectief met PNG- en BMP-formaten omdat ze verliesloze compressie gebruiken, waardoor de exacte pixelwaarden behouden blijven die nodig zijn voor betrouwbare steganografie-codering en -decodering.\n\n🔒 Privacy mindset\nDe Steganografie Decoder & Encoder extensie deelt, slaat of verzendt geen van je gegevens ergens naartoe.\n\n📌 Ondersteunde methoden\n\n1. steganografie decoder png\n2. bmp stegano decoder voor bitmap\n3. lsb stegano decoder logica voor stabiele, herhaalbare output\n4. lsb stegano png gebruiksgevallen voor screenshots en iconen\n5. steganografische jpg/jpeg ondersteuning\n\n🛠️ Probleemoplossing\n\n* gebruik originele PNG/BMP wanneer mogelijk (hercompressie kan de steganografie afbeelding decoder breken)\n* als decoderen mislukt, probeer dan een andere kopie van hetzelfde bestand\n* houd berichten klein voor stabiele LSB-codering\n* vermijd het converteren van PNG naar JPG voordat je stego decodet\n* vergelijk outputs wanneer je steganografische png decodet na exporteren\n\n⚡ Prestaties en beperkingen\nDe extensie verwerkt bestanden volledig in je browser met behulp van Web API's, zodat je bestanden nooit je apparaat verlaten. Deze lokale verwerking betekent geen uploadvertragingen, geen serverafhankelijkheden en volledige privacy. De verwerkingssnelheid hangt af van de bestandsgrootte: kleine iconen decoderen in milliseconden, terwijl foto's met hoge resolutie enkele seconden kunnen duren. De LSB-methode heeft een capaciteitslimiet: je kunt doorgaans ongeveer 1 byte gegevens per 8 pixels in een ongecomprimeerde foto inbedden. Voor de beste resultaten, gebruik ongecomprimeerde mediaformaten en houd ingebedde berichten beknopt. Vergeet niet dat JPG-bestanden verliesgevende compressie gebruiken, wat de steganografische inhoud kan beschadigen, dus ze zijn beter geschikt voor het decoderen van bestaande steganografie dan voor het coderen van nieuwe berichten.\n\nFAQ\nV: Welke formaten ondersteunt deze steganografie-tool?\nA: We ondersteunen png, bmp, jpeg, jpg. Nieuwe formaten kunnen in de toekomst worden toegevoegd.\n\nV: Welke methode gebruikt de extensie?\nA: Het gedraagt zich als een lsb steganografie decoder.\n\nV: Is het online of offline?\nA: Het vereist geen verbinding, dus het kan op beide manieren worden gebruikt.\n\nV: Kan het me helpen verborgen berichttekst te decoderen?\nA: Ja, sleep het bestand in de extensie en het zal verborgen informatie extraheren als deze beschikbaar is."
  }
}