{
  "appName": {
    "message": "Décodeur et Encodeur de Stéganographie"
  },
  "shortDesc": {
    "message": "Utilisez l'application Décodeur et Encodeur de Stéganographie pour intégrer ou extraire des métadonnées d'une image, déchiffrer la stéganographie dans les formats png, bmp, jpg."
  },
  "storeDesc": {
    "message": "Besoin d'extraire des messages secrets cachés dans des images qui semblent complètement normales et dont le contenu caché n'est pas visible ? Cette application de décodeur et encodeur de stéganographie lsb vous aide à décoder la stéganographie d'image en quelques secondes, directement dans votre navigateur. Elle fonctionne comme un décodeur de stéganographie d'image pour png/bmp/jpg/jpeg, vous permettant d'extraire des métadonnées et des messages stéganographiques cachés à partir de captures d'écran, de mèmes ou d'images de test sans installer d'outils de stéganographie lourds. De plus, vous pouvez intégrer des données secrètes invisibles dans une image.\n\n✅ Ce que vous pouvez faire\n• extraire des métadonnées d'image\n• révéler des images dans des images\n• déchiffrer la stéganographie à partir de fichiers multimédias\n• décoder la stéganographie dans différents formats\n• extraire des informations dissimulées à partir de pixels\n• intégrer des messages stéganographiques secrets\n• cacher du texte dans des images avec la stéganographie LSB\n• encoder un message dans un fichier multimédia pour un partage privé\n\n📌 Les formats pris en charge incluent\n- décodeur stegano png\n- décodeur stegano bmp\n- décodeur stegano jpg/jpeg\n\nComment décoder (guide rapide)\n1️⃣ Déposez un PNG/BMP/JPG/JPEG dans le décodeur de stéganographie\n2️⃣ Il analyse automatiquement les photos, extrait les métadonnées et déchiffre la stéganographie\n3️⃣ Si nécessaire, relancez après avoir enregistré une copie propre\n\nComment encoder (guide rapide)\n1️⃣ Tapez votre texte ou collez des données\n2️⃣ Choisissez une image PNG ou BMP\n3️⃣ Cliquez sur intégrer et enregistrez votre nouveau fichier\n4️⃣ Envoyez-le comme une image normale\n\n🧩 Pour qui c'est destiné\n▸ étudiants apprenant les bases de la détection de stéganographie et de LSB\n▸ créateurs souhaitant cacher un message dans png/bmp/jpg/jpeg\n▸ développeurs testant rapidement un outil de stéganographie d'image\n▸ joueurs de CTF ayant besoin de déchiffrer des indices de stéganographie\n▸ passionnés de stéganographie\n\nPourquoi les gens utilisent ce logiciel de stéganographie\n➤ vérifications rapides dans les chats, forums ou recherches\n➤ un outil stegano propre qui reste léger\n➤ une combinaison pratique de décodeur et encodeur stéganographique\n➤ utile lorsque vous devez extraire des secrets et valider des fichiers\n\n💡 Comment fonctionne la stéganographie LSB (Least Significant Bit)\nLSB modifie les bits de poids faible des valeurs de couleur des pixels pour intégrer une charge utile secrète. Étant donné que ces bits ont un impact visuel minimal, la photo semble inchangée à l'œil humain. Notre outil steg traite les fichiers pixel par pixel, lisant ou écrivant des données dans les bits de poids faible des canaux RGB. Cette méthode est particulièrement efficace avec les formats PNG et BMP car ils utilisent une compression sans perte, préservant les valeurs de pixel exactes nécessaires pour un encodage et un décodage stéganographiques fiables.\n\n🔒 Mentalité de confidentialité\nL'extension Décodeur et Encodeur de Stéganographie ne partage, ne sauvegarde ni n'envoie aucune de vos données nulle part.\n\n📌 Méthodes prises en charge\n\n1. décodeur de stéganographie png\n2. décodeur stegano bmp pour bitmap\n3. logique de décodeur stegano lsb pour une sortie stable et répétable\n4. cas d'utilisation de stegano lsb png pour captures d'écran et icônes\n5. support jpg/jpeg stéganographique\n\n🛠️ Dépannage\n\n* utilisez le PNG/BMP original lorsque cela est possible (la recompression peut casser le décodeur d'image de stéganographie)\n* si le décodage échoue, essayez une autre copie du même fichier\n* gardez les messages courts pour un encodage LSB stable\n* évitez de convertir PNG en JPG avant de déchiffrer le stego\n* comparez les sorties lorsque vous décodez un png stéganographique après exportation\n\n⚡ Performances et limitations\nL'extension traite les fichiers entièrement dans votre navigateur en utilisant les API Web, garantissant que vos fichiers ne quittent jamais votre appareil. Ce traitement local signifie pas de délais de téléchargement, pas de dépendances serveur et une confidentialité totale. La vitesse de traitement dépend de la taille du fichier : les petites icônes se décodent en millisecondes, tandis que les photos haute résolution peuvent prendre quelques secondes. La méthode LSB a une limite de capacité : vous pouvez généralement intégrer environ 1 octet de données par 8 pixels dans une photo non compressée. Pour de meilleurs résultats, utilisez des formats multimédias non compressés et gardez les messages intégrés concis. N'oubliez pas que les fichiers JPG utilisent une compression avec perte, ce qui peut corrompre le contenu stéganographique, ils sont donc mieux adaptés pour décoder une stéganographie existante plutôt que pour encoder de nouveaux messages.\n\nFAQ\nQ : Quels formats ce outil de stéganographie prend-il en charge ?\nR : Nous prenons en charge png, bmp, jpeg, jpg. De nouveaux formats peuvent être ajoutés à l'avenir.\n\nQ : Quelle méthode utilise l'extension ?\nR : Elle se comporte comme un décodeur de stéganographie lsb.\n\nQ : Est-ce en ligne ou hors ligne ?\nR : Il ne nécessite pas de connexion, donc il peut être utilisé de deux manières.\n\nQ : Peut-il m'aider à décoder un texte de message caché ?\nR : Oui, déposez le fichier dans l'extension et il extraira les informations dissimulées si elles sont disponibles."
  }
}