{
  "appName": {
    "message": "ステガノグラフィーデコーダー＆エンコーダー"
  },
  "shortDesc": {
    "message": "LSB画像ステガノグラフィーデコーダー＆エンコーダーアプリを使用して、画像からメタデータを埋め込んだり抽出したり、png、bmp、jpgのステガノグラフィーを復号化します。"
  },
  "storeDesc": {
    "message": "秘密のメッセージを、完全に普通に見える画像の中に隠されているものから抽出する必要がありますか？このLSBステガノグラフィーデコーダー＆エンコーダーアプリは、ブラウザ内で数秒で画像ステガノグラフィーをデコードするのに役立ちます。これは、png/bmp/jpg/jpeg用の画像ステガノグラフィーデコーダーとして機能し、重いステガノグラフィーツールをインストールすることなく、スクリーンショット、ミーム、またはテスト画像からメタデータや隠されたステガノグラフィックメッセージを抽出できます。さらに、画像の中に見えない秘密のデータを埋め込むこともできます。\n\n✅ できること\n• 画像からメタデータを抽出する\n• 画像の中の画像を明らかにする\n• メディアファイルからステガノグラフィーを復号する\n• 異なるフォーマットのステガノグラフィーをデコードする\n• ピクセルから隠された情報を抽出する\n• 秘密のステガノグラフィックメッセージを再埋め込む\n• LSBステガノグラフィーで画像にテキストを隠す\n• プライベート共有のためにメディアファイルにメッセージをエンコードする\n\n📌 対応フォーマットには以下が含まれます\n- pngステガノデコーダー\n- bmpステガノデコーダー\n- jpg/jpegステガノデコーダー\n\nデコード方法（クイックガイド）\n1️⃣ PNG/BMP/JPG/JPEGをステガノグラフィーデコーダーにドロップします\n2️⃣ 自動的に写真を解析し、メタデータを抽出し、ステガノグラフィーを復号します\n3️⃣ 必要に応じて、クリーンコピーを保存した後に再度実行します\n\nエンコード方法（クイックガイド）\n1️⃣ テキストを入力するかデータを貼り付けます\n2️⃣ PNGまたはBMPの画像を選択します\n3️⃣ 埋め込むをクリックして新しいファイルを保存します\n4️⃣ 通常の画像のように送信します\n\n🧩 これは誰のためのものか\n▸ ステガノグラフィーのデコードとLSBの基本を学ぶ学生\n▸ png/bmp/jpg/jpegにメッセージを隠したいクリエイター\n▸ 画像ステガノグラフィーツールを迅速にテストする開発者\n▸ ステガノグラフィーのヒントを復号する必要があるCTFプレイヤー\n▸ ステガノグラフィー愛好者\n\n人々がこのステガノグラフィーソフトウェアを使用する理由\n➤ チャット、フォーラム、または研究での迅速なチェック\n➤ 軽量なクリーンなステガノツール\n➤ 便利なステガノグラフィーデコーダーとエンコーダーのコンボ\n➤ 秘密を抽出し、ファイルを検証する必要があるときに役立つ\n\n💡 LSB（最下位ビット）ステガノグラフィーの仕組み\nLSBは、秘密のペイロードを埋め込むためにピクセルの色値の最下位ビットを変更します。これらのビットは視覚的な影響が最小限であるため、写真は人間の目には変わっていないように見えます。私たちのステガツールは、ファイルをピクセルごとに処理し、RGBチャンネルの最下位ビットでデータを読み書きします。この方法は、PNGおよびBMPフォーマットで特に効果的です。なぜなら、これらはロスレス圧縮を使用しており、信頼性のあるステガノグラフィーのエンコードとデコードに必要な正確なピクセル値を保持するからです。\n\n🔒 プライバシーの考え方\nステガノグラフィーデコーダー＆エンコーダー拡張機能は、あなたのデータをどこにも共有、保存、送信しません。\n\n📌 対応メソッド\n\n1. ステガノグラフィーデコーダーpng\n2. ビットマップ用のbmpステガノデコーダー\n3. 安定した再現可能な出力のためのlsbステガノデコーダーロジック\n4. スクリーンショットやアイコン用のlsbステガノpngユースケース\n5. ステガノグラフィックjpg/jpegサポート\n\n🛠️ トラブルシューティング\n\n* 可能な限り元のPNG/BMPを使用してください（再圧縮はステガノグラフィー画像デコーダーを破損させる可能性があります）\n* デコードが失敗した場合は、同じファイルの別のコピーを試してください\n* 安定したLSBエンコードのためにメッセージを小さく保ってください\n* ステゴを復号する前にPNGをJPGに変換するのは避けてください\n* エクスポート後にステガノグラフィックpngをデコードする際は出力を比較してください\n\n⚡ パフォーマンスと制限\nこの拡張機能は、Web APIを使用してブラウザ内でファイルを完全に処理し、あなたのファイルがデバイスを離れないことを保証します。このローカル処理により、アップロードの遅延やサーバー依存がなく、完全なプライバシーが確保されます。処理速度はファイルサイズに依存します—小さなアイコンはミリ秒でデコードされ、高解像度の写真は数秒かかることがあります。LSBメソッドには容量制限があります：通常、非圧縮の写真に対して8ピクセルごとに約1バイトのデータを埋め込むことができます。最良の結果を得るためには、非圧縮のメディアフォーマットを使用し、埋め込むメッセージを簡潔に保ってください。JPGファイルはロスのある圧縮を使用しているため、ステガノグラフィックコンテンツが破損する可能性があるため、新しいメッセージをエンコードするよりも既存のステガノグラフィーをデコードするのに適しています。\n\nFAQ\nQ: このステガノグラフィーツールはどのフォーマットをサポートしていますか？\nA: png、bmp、jpeg、jpgをサポートしています。将来的に新しいフォーマットが追加される可能性があります。\n\nQ: 拡張機能はどの方法を使用していますか？\nA: LSBステガノグラフィーデコーダーとして動作します。\n\nQ: オンラインですか、それともオフラインですか？\nA: 接続を必要としないため、どちらの方法でも使用できます。\n\nQ: 隠されたメッセージテキストをデコードするのに役立ちますか？\nA: はい、ファイルを拡張機能にドロップすると、利用可能な場合は隠された情報を抽出します。"
  }
}