{
  "appName": {
    "message": "Dekodér a enkodér steganografie"
  },
  "shortDesc": {
    "message": "Použijte aplikaci Dekodér a enkodér steganografie pro vložení nebo extrakci metadat z obrázku, dešifrování steganografie v png, bmp, jpg."
  },
  "storeDesc": {
    "message": "Potřebujete extrahovat tajné zprávy skryté uvnitř obrázků, které vypadají zcela normálně a skrytý obsah není viditelný? Tato aplikace pro dekodér a enkodér steganografie vám pomůže dekódovat obrazovou steganografii během několika sekund přímo ve vašem prohlížeči. Funguje jako dekodér obrazové steganografie pro png/bmp/jpg/jpeg, takže můžete extrahovat metadata a skryté steganografické zprávy ze snímků obrazovky, memů nebo testovacích obrázků, aniž byste museli instalovat těžké steganografické nástroje. Kromě toho můžete vložit neviditelná tajná data do obrázku.\n\n✅ Co můžete dělat\n• extrahovat metadata z obrázku\n• odhalit obrázky uvnitř obrázků\n• dešifrovat steganografii z mediálních souborů\n• dekódovat steganografii v různých formátech\n• extrahovat skryté informace z pixelů\n• vložit tajné steganografické zprávy zpět\n• skrýt text v obrázcích pomocí LSB steganografie\n• zakódovat zprávu do mediálního souboru pro soukromé sdílení\n\n📌 Podporované formáty zahrnují\n- png stegano dekodér\n- bmp stegano dekodér\n- jpg/jpeg stegano dekodér\n\nJak dekódovat (rychlý průvodce)\n1️⃣ Přetáhněte PNG/BMP/JPG/JPEG do dekodéru steganografie\n2️⃣ Automaticky zpracovává fotografie, extrahuje metadata a dešifruje steganografii\n3️⃣ Pokud je to potřeba, spusťte znovu po uložení čisté kopie\n\nJak enkódovat (rychlý průvodce)\n1️⃣ Napište svůj text nebo vložte data\n2️⃣ Vyberte obrázek PNG nebo BMP\n3️⃣ Klikněte na vložit a uložte svůj nový soubor\n4️⃣ Pošlete ho jako normální obrázek\n\n🧩 Pro koho je to určeno\n▸ studenti, kteří se učí základy dekódování steganografie a LSB\n▸ tvůrci, kteří chtějí skrýt zprávu v png/bmp/jpg/jpeg\n▸ vývojáři, kteří rychle testují nástroj pro obrazovou steganografii\n▸ hráči CTF, kteří potřebují dešifrovat nápovědy steganografie\n▸ nadšenci do steganografie\n\nProč lidé používají tento steganografický software\n➤ rychlé kontroly v chatech, fórech nebo výzkumu\n➤ čistý stegano nástroj, který zůstává lehký\n➤ praktický kombinovaný dekodér a enkodér steganografie\n➤ užitečné, když musíte extrahovat tajemství a ověřit soubory\n\n💡 Jak funguje LSB (Least Significant Bit) steganografie\nLSB modifikuje nejméně významné bity hodnot barev pixelů, aby vložil tajný obsah. Protože tyto bity mají minimální vizuální dopad, fotografie vypadá pro lidské oko nezměněně. Náš steg nástroj zpracovává soubory pixel po pixelu, čte nebo zapisuje data v nejméně významných bitech RGB kanálů. Tato metoda je obzvlášť efektivní u formátů PNG a BMP, protože používají bezztrátovou kompresi, která zachovává přesné hodnoty pixelů potřebné pro spolehlivé kódování a dekódování steganografie.\n\n🔒 Ochrana soukromí\nRozšíření Dekodér a enkodér steganografie nesdílí, neukládá ani neposílá žádná vaše data nikam.\n\n📌 Podporované metody\n\n1. dekodér steganografie png\n2. bmp stegano dekodér pro bitmapy\n3. lsb stegano dekodér logika pro stabilní, opakovatelný výstup\n4. lsb stegano png případy použití pro snímky obrazovky a ikony\n5. podpora steganografických jpg/jpeg\n\n🛠️ Řešení problémů\n\n* použijte originální PNG/BMP, když je to možné (rekomprese může rozbít dekodér steganografie)\n* pokud dekódování selže, zkuste jinou kopii stejného souboru\n* udržujte zprávy malé pro stabilní LSB kódování\n* vyhněte se převodu PNG na JPG před dešifrováním stego\n* porovnejte výstupy, když dekódujete steganografické png po exportu\n\n⚡ Výkon a omezení\nRozšíření zpracovává soubory zcela ve vašem prohlížeči pomocí Web API, což zajišťuje, že vaše soubory nikdy neopustí vaše zařízení. Toto místní zpracování znamená žádné zpoždění při nahrávání, žádné závislosti na serveru a úplné soukromí. Rychlost zpracování závisí na velikosti souboru - malé ikony se dekódují během milisekund, zatímco fotografie s vysokým rozlišením mohou trvat několik sekund. Metoda LSB má limit kapacity: obvykle můžete vložit asi 1 byte dat na 8 pixelů v nekomprimované fotografii. Pro nejlepší výsledky používejte nekomprimované mediální formáty a udržujte vložené zprávy stručné. Pamatujte, že JPG soubory používají ztrátovou kompresi, která může poškodit steganografický obsah, takže jsou lépe vhodné pro dekódování existující steganografie než pro kódování nových zpráv.\n\nFAQ\nQ: Jaké formáty tento steganografický nástroj podporuje?\nA: Podporujeme png, bmp, jpeg, jpg. Nové formáty mohou být přidány v budoucnu.\n\nQ: Jakou metodu rozšíření používá?\nA: Chová se jako dekodér lsb steganografie.\n\nQ: Je to online nebo offline?\nA: Nevyžaduje připojení, takže může být používáno oběma způsoby.\n\nQ: Může mi pomoci dekódovat skrytý text zprávy?\nA: Ano, přetáhněte soubor do rozšíření a extrahuje skryté informace, pokud jsou k dispozici."
  }
}