{
  "appName": {
    "message": "Mchambuzi na Mwandikaji wa Steganografia"
  },
  "shortDesc": {
    "message": "Tumia programu ya Mchambuzi na Mwandikaji wa Steganografia ya picha kutumia LSB ili kuingiza au kutoa metadata kutoka kwa picha, kufungua steganografia katika png, bmp, jpg."
  },
  "storeDesc": {
    "message": "Unahitaji kutoa ujumbe wa siri uliofichwa ndani ya picha ambazo zinaonekana kawaida kabisa na maudhui yaliyofichwa hayaonekani? Huu ni mchambuzi na mwandikaji wa steganografia wa lsb ambao hukusaidia kufichua steganografia ya picha kwa sekunde, moja kwa moja kwenye kivinjari chako. Inafanya kazi kama mchambuzi wa steganografia ya picha kwa png/bmp/jpg/jpeg, hivyo unaweza kutoa metadata na ujumbe wa steganografia uliofichwa kutoka kwa picha za skrini, memes, au picha za majaribio bila kufunga zana nzito za steganografia. Zaidi ya hayo, unaweza kuingiza data ya siri isiyoonekana ndani ya picha.\n\n✅ Kile unachoweza kufanya\n• toa metadata kutoka kwa picha\n• funua picha ndani ya picha\n• fungua steganografia kutoka kwa faili za media\n• fanya decode steganografia katika mifumo tofauti\n• toa taarifa zilizofichwa kutoka kwa pixels\n• ingiza ujumbe wa steganografia wa siri tena\n• ficha maandiko katika picha kwa steganografia ya LSB\n• andika ujumbe katika faili ya media kwa ajili ya kushiriki kwa faragha\n\n📌 Mifumo inayoungwa mkono ni pamoja na\n- png mchambuzi wa steganografia\n- bmp mchambuzi wa steganografia\n- jpg/jpeg mchambuzi wa steganografia\n\nJinsi ya kufichua (mwongozo wa haraka)\n1️⃣ Tupa PNG/BMP/JPG/JPEG kwenye mchambuzi wa steganografia\n2️⃣ Inachambua picha moja kwa moja, inatoa metadata na kufungua steganografia\n3️⃣ Ikiwa inahitajika, endelea tena baada ya kuhifadhi nakala safi\n\nJinsi ya kuandika (mwongozo wa haraka)\n1️⃣ Andika maandiko yako au bandika data\n2️⃣ Chagua picha ya PNG au BMP\n3️⃣ Bonyeza ingiza na uhifadhi faili yako mpya\n4️⃣ Tuma kama picha ya kawaida\n\n🧩 Hii ni kwa nani\n▸ wanafunzi wanaojifunza kufichua steganografia na misingi ya LSB\n▸ waumbaji wanaotaka kuficha ujumbe katika png/bmp/jpg/jpeg\n▸ wabunifu wanaojaribu zana ya steganografia ya picha haraka\n▸ wachezaji wa CTF wanaohitaji kufungua vidokezo vya steganografia\n▸ wapenzi wa steganografia\n\nKwa nini watu wanatumia programu hii ya steganografia\n➤ ukaguzi wa haraka katika mazungumzo, majukwaa, au utafiti\n➤ zana safi ya steganografia inayobaki nyepesi\n➤ mchanganyiko wa mchambuzi na mwandikaji wa steganografia wenye manufaa\n➤ inafaida unapohitaji kutoa siri na kuthibitisha faili\n\n💡 Jinsi LSB (Least Significant Bit) steganografia inavyofanya kazi\nLSB hubadilisha bits za chini kabisa za thamani za rangi za pixel ili kuingiza mzigo wa siri. Kwa kuwa bits hizi zina athari ndogo ya kuona, picha inaonekana kuwa haijabadilika kwa jicho la mwanadamu. Zana yetu ya steganografia inachakata faili pixel kwa pixel, ikisoma au kuandika data katika bits za chini kabisa za channel za RGB. Njia hii ni bora hasa kwa mifumo ya PNG na BMP kwa sababu zinatumia usindikaji usio na hasara, kuhifadhi thamani halisi za pixel zinazohitajika kwa kuandika na kufichua steganografia kwa uaminifu.\n\n🔒 Mawazo ya faragha\nMchambuzi na Mwandikaji wa Steganografia haushiriki, kuhifadhi au kutuma data yako popote.\n\n📌 Njia zinazoungwa mkono\n\n1. mchambuzi wa steganografia png\n2. mchambuzi wa bmp wa steganografia kwa bitmap\n3. mantiki ya mchambuzi wa lsb wa steganografia kwa matokeo thabiti, yanayoweza kurudiwa\n4. matumizi ya lsb steganografia ya png kwa picha za skrini na alama\n5. msaada wa steganografia ya jpg/jpeg\n\n🛠️ Kutatua matatizo\n\n* tumia PNG/BMP asilia inapowezekana (urekebishaji unaweza kuharibu mchambuzi wa picha za steganografia)\n* ikiwa kufichua kunashindikana, jaribu nakala nyingine ya faili hiyo hiyo\n* weka ujumbe kuwa mdogo kwa ajili ya kuandika LSB thabiti\n* epuka kubadilisha PNG kuwa JPG kabla ya kufichua stego\n* linganisha matokeo unapofichua steganografia ya png baada ya kusafirisha\n\n⚡ Utendaji na mipaka\nMchambuzi huu unachakata faili kabisa kwenye kivinjari chako kwa kutumia Web APIs, kuhakikisha faili zako hazitoki kwenye kifaa chako. Usindikaji huu wa ndani unamaanisha hakuna ucheleweshaji wa kupakia, hakuna utegemezi wa seva, na faragha kamili. Kasi ya usindikaji inategemea saizi ya faili—alama ndogo zinafichuliwa kwa milisekunde, wakati picha zenye azimio la juu zinaweza kuchukua sekunde chache. Njia ya LSB ina kikomo cha uwezo: kwa kawaida unaweza kuingiza takriban byte 1 ya data kwa pixels 8 katika picha isiyo na usindikaji. Kwa matokeo bora, tumia mifumo ya media isiyo na usindikaji na weka ujumbe ulioingizwa kuwa mfupi. Kumbuka kwamba faili za JPG zinatumia usindikaji wa kupoteza, ambao unaweza kuharibu maudhui ya steganografia, hivyo zinafaa zaidi kwa kufichua steganografia iliyopo badala ya kuandika ujumbe mpya.\n\nMaswali Yanayoulizwa Mara kwa Mara\nQ: Mifumo gani zana hii ya steganografia inasaidia?\nA: Tunasaidia png, bmp, jpeg, jpg. Mifumo mipya inaweza kuongezwa katika siku zijazo.\n\nQ: Njia gani inatumika na nyongeza hii?\nA: Inafanya kazi kama mchambuzi wa steganografia wa lsb.\n\nQ: Je, ni mtandaoni au offline?\nA: Haihitaji muunganisho hivyo inaweza kutumika kwa njia zote mbili.\n\nQ: Je, inaweza kunisaidia kufichua maandiko ya ujumbe uliofichwa?\nA: Ndio, tupa faili kwenye nyongeza na itatoa taarifa zilizofichwa ikiwa zinapatikana."
  }
}