{
  "appName": {
    "message": "מפענח ומקודד סטגנוגרפיה"
  },
  "shortDesc": {
    "message": "השתמש באפליקציית מפענח ומקודד סטגנוגרפיה של תמונות LSB כדי להטמיע או לחלץ מטא-נתונים מתמונה, לפענח סטגנוגרפיה ב-png, bmp, jpg"
  },
  "storeDesc": {
    "message": "צריכים לחלץ הודעות סודיות המוסתרות בתוך תמונות שנראות רגילות לחלוטין והתוכן המוסתר אינו גלוי? אפליקציית מפענח ומקודד סטגנוגרפיה lsb זו עוזרת לכם לפענח סטגנוגרפיה של תמונות תוך שניות, ישירות בדפדפן שלכם. היא פועלת כמפענח סטגנוגרפיה של תמונות עבור png/bmp/jpg/jpeg, כך שתוכלו לחלץ מטא-דאטה והודעות סטגנוגרפיות נסתרות מצילומי מסך, ממים או תמונות בדיקה מבלי להתקין כלי סטגנוגרפיה כבדים. בנוסף, תוכלו להטמיע נתונים סודיים בלתי נראים בתוך תמונה.\n\n ✅ מה אתם יכולים לעשות\n • לחלץ מטא-דאטה מהתמונה\n • לחשוף תמונות בתוך תמונות\n • לפענח סטגנוגרפיה מקבצי מדיה\n • לפענח סטגנוגרפיה בפורמטים שונים\n • לחלץ מידע מוסתר מפיקסלים\n • להטמיע הודעות סטגנוגרפיות סודיות בחזרה\n • הסתר טקסט בתמונות עם סטגנוגרפיה של LSB\n • לקודד הודעה בקובץ מדיה לשיתוף פרטי\n\n 📌 פורמטים נתמכים כוללים\n מפענח png של stegano\n מפענח bmp stegano\n - מפענח סטגנו jpg/jpeg\n\n איך לפענח (מדריך מהיר)\n 1️⃣ הכניסו קובץ PNG/BMP/JPG/JPEG למפענח הסטגנוגרפיה\n 2️⃣ זה מנתח תמונות באופן אוטומטי, מחלץ מטא-דאטה ומפענח סטגונוגרפיה.\n 3️⃣ במידת הצורך, הפעל שוב לאחר שמירת עותק נקי\n\n איך לקודד (מדריך מהיר)\n 1️⃣ הקלד את הטקסט שלך או הדבק נתונים\n 2️⃣ בחרו תמונה בפורמט PNG או BMP\n 3️⃣ לחצו על הטמעה ושמרו את הקובץ החדש\n 4️⃣ שלח את זה כמו תמונה רגילה\n\n 🧩 למי זה מיועד\n ▸ תלמידים הלומדים פענוח סטגנוגרפיה ויסודות LSB\n ▸ יוצרים שרוצים להסתיר הודעה בפורמט png/bmp/jpg/jpeg\n ▸ מפתחים בודקים כלי סטגנוגרפיה של תמונות במהירות\n ▸ שחקני CTF שצריכים לפענח רמזים סטגנוגרפיים\n ▸ חובבי סטגנוגרפיה\n\n למה אנשים משתמשים בתוכנת סטגנוגרפיה הזו\n ➤ בדיקות מהירות בצ&#39;אטים, פורומים או מחקר\n ➤ כלי סטגנו נקי שנשאר קל משקל\n ➤ שילוב מפענח ומקודד סטגנוגרפיים שימושי\n ➤ שימושי כשעליך לחלץ סודות ולאמת קבצים\n\n 💡 איך עובדת סטגנוגרפיה של LSB (ביט משמעותי פחות)\n LSB משנה את הביטים הפחות משמעותיים של ערכי צבע הפיקסלים כדי להטמיע מטען סודי. מכיוון שלביטים אלה יש השפעה חזותית מינימלית, התמונה נראית ללא שינוי לעין האנושית. כלי ה-steg שלנו מעבד קבצים פיקסל אחר פיקסל, וקורא או כותב נתונים בביטים הפחות משמעותיים של ערוצי RGB. שיטה זו יעילה במיוחד עם פורמטי PNG ו-BMP מכיוון שהם משתמשים בדחיסה ללא אובדן נתונים, ומשמרים את ערכי הפיקסלים המדויקים הדרושים לקידוד ופענוח סטגנוגרפיה אמינים.\n\n 🔒 חשיבה של פרטיות\n התוסף Steganography Decoder &amp; Encoder אינו משתף, שומר או שולח את הנתונים שלך לשום מקום.\n\n 📌 שיטות נתמכות\n\n 1. מפענח סטגנוגרפיה png\n 2. מפענח bmp stegano עבור מפת סיביות\n 3. לוגיקת מפענח lsb stegano לפלט יציב וחזרתי\n 4. מקרי שימוש ב-lsb stegano png עבור צילומי מסך ואייקונים\n 5. תמיכה בקובצי jpg/jpeg סטגנוגרפיים\n\n 🛠️ פתרון בעיות\n\n * השתמשו ב-PNG/BMP מקוריים במידת האפשר (דחיסה חוזרת עלולה לשבש את מפענח התמונות של הסטגנוגרפיה)\n אם הפענוח נכשל, נסה עותק אחר של אותו קובץ\n * שמור על הודעות קטנות לקידוד LSB יציב\n * הימנעו מהמרת PNG ל-JPG לפני פענוח stego\n * השווה פלטים בעת פענוח png סטגנוגרפי לאחר ייצוא\n\n ⚡ ביצועים ומגבלות\n התוסף מעבד קבצים במלואם בדפדפן שלך באמצעות ממשקי API של אינטרנט, מה שמבטיח שהקבצים שלך לעולם לא יעזבו את המכשיר שלך. עיבוד מקומי זה פירושו שאין עיכובים בהעלאה, אין תלות בשרת ופרטיות מוחלטת. מהירות העיבוד תלויה בגודל הקובץ - סמלים קטנים מפענחים באלפיות השנייה, בעוד שתמונות ברזולוציה גבוהה עשויות להימשך מספר שניות. לשיטת LSB יש מגבלת קיבולת: בדרך כלל ניתן להטמיע כ-1 בייט של נתונים לכל 8 פיקסלים בתמונה לא דחוסה. לקבלת התוצאות הטובות ביותר, השתמש בפורמטי מדיה לא דחוסים ושמור על הודעות מוטמעות תמציתיות. זכור שקבצי JPG משתמשים בדחיסה עם אובדן נתונים, אשר עלולה לפגוע בתוכן סטגנוגרפי, ולכן הם מתאימים יותר לפענוח סטגנוגרפיה קיימת מאשר לקידוד הודעות חדשות.\n\n שאלות נפוצות\n ש: אילו פורמטים תומך כלי הסטגנוגרפיה הזה?\n א: אנו תומכים בפורמטים png, bmp, jpeg, jpg. ייתכן שיתווספו פורמטים חדשים בעתיד.\n\n ש: באיזו שיטה משתמשת ההרחבה?\n א: זה מתנהג כמפענח סטגנוגרפיה lsb\n\n ש: האם זה מקוון או לא מקוון?\n א: זה לא דורש חיבור ולכן ניתן להשתמש בו בשני הכיוונים\n\n ש: האם זה יכול לעזור לי לפענח טקסט של הודעה נסתרת?\n א: כן, שחררו את הקובץ לתוך ההרחבה והיא תחלץ מידע מוסתר אם הוא זמין.\n"
  }
}