{
  "appName": {
    "message": "Steganografický dekodér a enkodér"
  },
  "shortDesc": {
    "message": "Použite aplikáciu Steganografický dekodér a enkodér na dekódovanie a enkódovanie obrázkov, aby ste vložili alebo extrahovali metadata z obrázkov, dešifrovali steganografiu v png, bmp, jpg."
  },
  "storeDesc": {
    "message": "Potrebujete extrahovať tajné správy skryté v obrázkoch, ktoré vyzerajú úplne normálne a skrytý obsah nie je viditeľný? Táto aplikácia na dekódovanie a enkódovanie lsb steganografie vám pomôže dekódovať obrazovú steganografiu za sekundy priamo vo vašom prehliadači. Funguje ako dekodér obrazovej steganografie pre png/bmp/jpg/jpeg, takže môžete extrahovať metadata a skryté steganografické správy zo snímok obrazovky, meme alebo testovacích obrázkov bez inštalácie ťažkých steganografických nástrojov. Okrem toho môžete vložiť neviditeľné tajné údaje do obrázka.\n\n✅ Čo môžete robiť\n• extrahovať metadata z obrázka\n• odhaliť obrázky v obrázkoch\n• dešifrovať steganografiu z mediálnych súborov\n• dekódovať steganografiu v rôznych formátoch\n• extrahovať skryté informácie z pixelov\n• vložiť tajné steganografické správy späť\n• skryť text v obrázkoch pomocou LSB steganografie\n• enkódovať správu do mediálneho súboru na súkromné zdieľanie\n\n📌 Podporované formáty zahŕňajú\n- png stegano dekodér\n- bmp stegano dekodér\n- jpg/jpeg stegano dekodér\n\nAko dekódovať (rýchly sprievodca)\n1️⃣ Nahrajte PNG/BMP/JPG/JPEG do steganografického dekodéra\n2️⃣ Automaticky spracováva fotografie, extrahuje metadata a dešifruje steganografiu\n3️⃣ Ak je to potrebné, spustite znova po uložení čistej kópie\n\nAko enkódovať (rýchly sprievodca)\n1️⃣ Napíšte svoj text alebo vložte údaje\n2️⃣ Vyberte obrázok PNG alebo BMP\n3️⃣ Kliknite na vložiť a uložte svoj nový súbor\n4️⃣ Pošlite ho ako normálny obrázok\n\n🧩 Pre koho je to určené\n▸ študenti, ktorí sa učia základy dekódovania steganografie a LSB\n▸ tvorcovia, ktorí chcú skryť správu v png/bmp/jpg/jpeg\n▸ vývojári, ktorí rýchlo testujú nástroj na obrazovú steganografiu\n▸ hráči CTF, ktorí potrebujú dešifrovať nápovedy steganografie\n▸ nadšenci steganografie\n\nPrečo ľudia používajú tento softvér na steganografiu\n➤ rýchle kontroly v chatoch, fórach alebo výskume\n➤ čistý steganografický nástroj, ktorý zostáva ľahký\n➤ praktický kombinovaný dekodér a enkodér steganografie\n➤ užitočné, keď musíte extrahovať tajomstvá a overiť súbory\n\n💡 Ako funguje LSB (najmenej významný bit) steganografia\nLSB modifikuje najmenej významné bity hodnôt farieb pixelov na vloženie tajného nákladu. Keďže tieto bity majú minimálny vizuálny dopad, fotografia vyzerá pre ľudské oko nezmenená. Náš steganografický nástroj spracováva súbory pixel po pixeli, číta alebo zapisuje údaje v najmenej významných bitoch RGB kanálov. Táto metóda je obzvlášť účinná pri formátoch PNG a BMP, pretože používajú bezstratovú kompresiu, ktorá zachováva presné hodnoty pixelov potrebné na spoľahlivé enkódovanie a dekódovanie steganografie.\n\n🔒 Ochrana súkromia\nRozšírenie Steganografický dekodér a enkodér nezdieľa, neukladá ani neposiela žiadne vaše údaje nikam.\n\n📌 Podporované metódy\n\n1. steganografický dekodér png\n2. bmp stegano dekodér pre bitmapy\n3. lsb stegano dekodér logika pre stabilný, opakovateľný výstup\n4. lsb stegano png prípady použitia pre snímky obrazovky a ikony\n5. podpora steganografického jpg/jpeg\n\n🛠️ Riešenie problémov\n\n* používajte originálny PNG/BMP, keď je to možné (rekompresia môže rozbiť dekodér steganografie)\n* ak dekódovanie zlyhá, skúste inú kópiu toho istého súboru\n* udržujte správy malé pre stabilné LSB enkódovanie\n* vyhnite sa konverzii PNG na JPG pred dešifrovaním stego\n* porovnajte výstupy, keď dekódujete steganografické png po exporte\n\n⚡ Výkon a obmedzenia\nRozšírenie spracováva súbory úplne vo vašom prehliadači pomocou Web API, čo zabezpečuje, že vaše súbory nikdy neopustia vaše zariadenie. Toto miestne spracovanie znamená žiadne oneskorenia pri nahrávaní, žiadne závislosti na serveri a úplné súkromie. Rýchlosť spracovania závisí od veľkosti súboru - malé ikony sa dekódujú za milisekundy, zatiaľ čo fotografie s vysokým rozlíšením môžu trvať niekoľko sekúnd. Metóda LSB má limit kapacity: zvyčajne môžete vložiť asi 1 byte údajov na 8 pixelov v nekomprimovanej fotografii. Pre najlepšie výsledky používajte nekomprimované mediálne formáty a udržujte vložené správy stručné. Pamätajte, že JPG súbory používajú stratovú kompresiu, ktorá môže poškodiť steganografický obsah, takže sú lepšie vhodné na dekódovanie existujúcej steganografie než na enkódovanie nových správ.\n\nČASTO KLADENÉ OTÁZKY\nQ: Aké formáty tento nástroj na steganografiu podporuje?\nA: Podporujeme png, bmp, jpeg, jpg. Nové formáty môžu byť pridané v budúcnosti.\n\nQ: Akú metódu rozšírenie používa?\nA: Správa sa správa ako lsb steganografický dekodér.\n\nQ: Je to online alebo offline?\nA: Nevyžaduje pripojenie, takže sa dá používať oboma spôsobmi.\n\nQ: Môže mi to pomôcť dekódovať skrytý text správy?\nA: Áno, nahrajte súbor do rozšírenia a extrahuje skryté informácie, ak sú k dispozícii."
  }
}