{
  "appName": {
    "message": "Декодер та кодувальник стеганографії"
  },
  "shortDesc": {
    "message": "Використовуйте додаток Декодер та кодувальник стеганографії для вбудовування або вилучення метаданих з зображення, розшифровки стеганографії у png, bmp, jpg."
  },
  "storeDesc": {
    "message": "Потрібно витягти секретні повідомлення, приховані всередині зображень, які виглядають абсолютно нормально, і прихований вміст не видно? Цей додаток \"Декодер та кодувальник стеганографії\" допомагає вам декодувати стеганографію зображень за кілька секунд, прямо у вашому браузері. Він працює як декодер стеганографії для png/bmp/jpg/jpeg, тому ви можете витягувати метадані та приховані стеганографічні повідомлення з скріншотів, мемів або тестових зображень без установки важких стеганографічних інструментів. Крім того, ви можете вбудовувати невидимі секретні дані всередину зображення.\n\n✅ Що ви можете зробити\n• витягувати метадані з зображення\n• виявляти зображення всередині зображень\n• розшифровувати стеганографію з медіафайлів\n• декодувати стеганографію в різних форматах\n• витягувати приховану інформацію з пікселів\n• вбудовувати секретні стеганографічні повідомлення назад\n• ховати текст у картинках за допомогою LSB стеганографії\n• кодувати повідомлення в медіафайлі для приватного обміну\n\n📌 Підтримувані формати включають\n- декодер png стегано\n- декодер bmp стегано\n- декодер jpg/jpeg стегано\n\nЯк декодувати (швидкий посібник)\n1️⃣ Перетягніть PNG/BMP/JPG/JPEG у декодер стеганографії\n2️⃣ Він автоматично аналізує фотографії, витягує метадані та розшифровує стеганографію\n3️⃣ Якщо потрібно, запустіть знову після збереження чистої копії\n\nЯк кодувати (швидкий посібник)\n1️⃣ Введіть свій текст або вставте дані\n2️⃣ Виберіть картинку PNG або BMP\n3️⃣ Натисніть \"вбудувати\" та збережіть свій новий файл\n4️⃣ Надішліть його як звичайну картинку\n\n🧩 Для кого це\n▸ студенти, які вивчають основи декодування стеганографії та LSB\n▸ творці, які хочуть приховати повідомлення в png/bmp/jpg/jpeg\n▸ розробники, які швидко тестують інструмент стеганографії зображень\n▸ гравці CTF, яким потрібно розшифрувати підказки стеганографії\n▸ ентузіасти стеганографії\n\nЧому люди використовують це програмне забезпечення стеганографії\n➤ швидкі перевірки в чатах, форумах або дослідженнях\n➤ чистий стеганографічний інструмент, який залишається легким\n➤ зручний комбо декодер та кодувальник стеганографії\n➤ корисно, коли потрібно витягти секрети та перевірити файли\n\n💡 Як працює LSB (найменш значущий біт) стеганографія\nLSB модифікує найменш значущі біти значень кольору пікселів, щоб вбудувати секретний вантаж. Оскільки ці біти мають мінімальний візуальний вплив, фотографія виглядає незмінною для людського ока. Наш стеганографічний інструмент обробляє файли піксель за пікселем, читаючи або записуючи дані в найменш значущих бітах RGB-каналів. Цей метод особливо ефективний з форматами PNG та BMP, оскільки вони використовують безвтратне стиснення, зберігаючи точні значення пікселів, необхідні для надійного кодування та декодування стеганографії.\n\n🔒 Підхід до конфіденційності\nРозширення \"Декодер та кодувальник стеганографії\" не ділиться, не зберігає і не надсилає жодних ваших даних куди-небудь.\n\n📌 Підтримувані методи\n\n1. декодер стеганографії png\n2. декодер bmp стегано для бітових картин\n3. логіка декодера lsb стегано для стабільного, повторюваного виходу\n4. випадки використання lsb стегано png для скріншотів та іконок\n5. підтримка стеганографічних jpg/jpeg\n\n🛠️ Виправлення помилок\n\n* використовуйте оригінальний PNG/BMP, коли це можливо (перекомпресія може зламати декодер стеганографії зображення)\n* якщо декодування не вдається, спробуйте іншу копію того ж файлу\n* тримайте повідомлення маленькими для стабільного кодування LSB\n* уникайте перетворення PNG в JPG перед розшифровкою стеганографії\n* порівнюйте виходи, коли декодуєте стеганографічний png після експорту\n\n⚡ Продуктивність та обмеження\nРозширення обробляє файли повністю у вашому браузері, використовуючи Web API, що забезпечує, що ваші файли ніколи не залишають ваш пристрій. Це локальне оброблення означає відсутність затримок при завантаженні, відсутність залежностей від сервера та повну конфіденційність. Швидкість обробки залежить від розміру файлу — маленькі іконки декодуються за мілісекунди, тоді як фотографії високої роздільної здатності можуть зайняти кілька секунд. Метод LSB має обмеження ємності: зазвичай ви можете вбудувати близько 1 байта даних на 8 пікселів у незжатій фотографії. Для найкращих результатів використовуйте незжаті медіаформати та тримайте вбудовані повідомлення короткими. Пам'ятайте, що файли JPG використовують стиснення з втратами, що може пошкодити стеганографічний вміст, тому вони краще підходять для декодування існуючої стеганографії, ніж для кодування нових повідомлень.\n\nЧасті запитання\nQ: Які формати підтримує цей інструмент стеганографії?\nA: Ми підтримуємо png, bmp, jpeg, jpg. Нові формати можуть бути додані в майбутньому.\n\nQ: Який метод використовує розширення?\nA: Він поводиться як декодер lsb стеганографії.\n\nQ: Це онлайн чи офлайн?\nA: Він не вимагає підключення, тому може використовуватися обома способами.\n\nQ: Чи може він допомогти мені декодувати приховане текстове повідомлення?\nA: Так, перетягніть файл у розширення, і воно витягне приховану інформацію, якщо вона доступна."
  }
}