{
  "appName": {
    "message": "Decodificador y Codificador de Esteganografía"
  },
  "shortDesc": {
    "message": "Utiliza la aplicación Decodificador y Codificador de Esteganografía para incrustar o extraer metadatos de imágenes, descifrar esteganografía en png, bmp, jpg."
  },
  "storeDesc": {
    "message": "¿Necesitas extraer mensajes secretos ocultos dentro de imágenes que parecen completamente normales y cuyo contenido oculto no es visible? Esta aplicación de decodificador y codificador de esteganografía LSB te ayuda a decodificar la esteganografía de imágenes en segundos, directamente en tu navegador. Funciona como un decodificador de esteganografía de imágenes para png/bmp/jpg/jpeg, por lo que puedes extraer metadatos y mensajes esteganográficos ocultos de capturas de pantalla, memes o imágenes de prueba sin instalar herramientas de esteganografía pesadas. Además, puedes incrustar datos secretos invisibles dentro de una imagen.\n\n✅ Lo que puedes hacer\n• extraer metadatos de la imagen\n• revelar imágenes dentro de imágenes\n• descifrar esteganografía de archivos multimedia\n• decodificar esteganografía en diferentes formatos\n• extraer información oculta de los píxeles\n• incrustar mensajes esteganográficos secretos de vuelta\n• ocultar texto en imágenes con esteganografía LSB\n• codificar mensajes en archivos multimedia para compartir de forma privada\n\n📌 Los formatos compatibles incluyen\n- decodificador de esteganografía png\n- decodificador de esteganografía bmp\n- decodificador de esteganografía jpg/jpeg\n\nCómo decodificar (guía rápida)\n1️⃣ Suelta un PNG/BMP/JPG/JPEG en el decodificador de esteganografía\n2️⃣ Automáticamente analiza las fotos, extrae metadatos y descifra la esteganografía\n3️⃣ Si es necesario, vuelve a ejecutar después de guardar una copia limpia\n\nCómo codificar (guía rápida)\n1️⃣ Escribe tu texto o pega datos\n2️⃣ Elige una imagen PNG o BMP\n3️⃣ Haz clic en incrustar y guarda tu nuevo archivo\n4️⃣ Envíalo como una imagen normal\n\n🧩 Para quién es esto\n▸ estudiantes que aprenden a decodificar esteganografía y los conceptos básicos de LSB\n▸ creadores que quieren ocultar mensajes en png/bmp/jpg/jpeg\n▸ desarrolladores que prueban rápidamente una herramienta de esteganografía de imágenes\n▸ jugadores de CTF que necesitan descifrar pistas de esteganografía\n▸ entusiastas de la esteganografía\n\nPor qué la gente usa este software de esteganografía\n➤ verificaciones rápidas en chats, foros o investigaciones\n➤ una herramienta de esteganografía limpia que se mantiene ligera\n➤ una combinación práctica de decodificador y codificador esteganográfico\n➤ útil cuando necesitas extraer secretos y validar archivos\n\n💡 Cómo funciona la esteganografía LSB (Least Significant Bit)\nLSB modifica los bits menos significativos de los valores de color de los píxeles para incrustar una carga secreta. Dado que estos bits tienen un impacto visual mínimo, la foto parece inalterada a la vista humana. Nuestra herramienta de esteganografía procesa archivos píxel por píxel, leyendo o escribiendo datos en los bits menos significativos de los canales RGB. Este método es particularmente efectivo con formatos PNG y BMP porque utilizan compresión sin pérdida, preservando los valores exactos de los píxeles necesarios para una codificación y decodificación de esteganografía confiable.\n\n🔒 Mentalidad de privacidad\nLa extensión Decodificador y Codificador de Esteganografía no comparte, guarda ni envía ninguno de tus datos a ninguna parte.\n\n📌 Métodos compatibles\n\n1. decodificador de esteganografía png\n2. decodificador de esteganografía bmp para bitmap\n3. lógica de decodificador de esteganografía lsb para salida estable y repetible\n4. casos de uso de esteganografía lsb png para capturas de pantalla e íconos\n5. soporte esteganográfico jpg/jpeg\n\n🛠️ Solución de problemas\n\n* usa PNG/BMP original cuando sea posible (la recomposición puede romper el decodificador de imágenes de esteganografía)\n* si la decodificación falla, prueba otra copia del mismo archivo\n* mantén los mensajes pequeños para una codificación LSB estable\n* evita convertir PNG a JPG antes de descifrar el estego\n* compara las salidas cuando decodifiques png esteganográfico después de exportar\n\n⚡ Rendimiento y limitaciones\nLa extensión procesa archivos completamente en tu navegador utilizando APIs web, asegurando que tus archivos nunca salgan de tu dispositivo. Este procesamiento local significa que no hay retrasos de carga, sin dependencias de servidor y completa privacidad. La velocidad de procesamiento depende del tamaño del archivo: los íconos pequeños se decodifican en milisegundos, mientras que las fotos de alta resolución pueden tardar unos segundos. El método LSB tiene un límite de capacidad: típicamente puedes incrustar alrededor de 1 byte de datos por cada 8 píxeles en una foto sin comprimir. Para obtener los mejores resultados, utiliza formatos de medios sin comprimir y mantén los mensajes incrustados concisos. Recuerda que los archivos JPG utilizan compresión con pérdida, lo que puede corromper el contenido esteganográfico, por lo que son más adecuados para decodificar esteganografía existente en lugar de codificar nuevos mensajes.\n\nFAQ\nQ: ¿Qué formatos admite esta herramienta de esteganografía?\nA: Admitimos png, bmp, jpeg, jpg. Se pueden agregar nuevos formatos en el futuro.\n\nQ: ¿Qué método utiliza la extensión?\nA: Se comporta como un decodificador de esteganografía lsb.\n\nQ: ¿Es en línea o fuera de línea?\nA: No requiere conexión, por lo que se puede usar de ambas maneras.\n\nQ: ¿Puede ayudarme a decodificar texto de mensajes ocultos?\nA: Sí, suelta el archivo en la extensión y extraerá información oculta si está disponible."
  }
}