{
  "appName": {
    "message": "Dekoder at Encoder ng Steganograpiya"
  },
  "shortDesc": {
    "message": "Gamitin ang Dekoder at Encoder ng Steganograpiya na app upang mag-embed o mag-extract ng metadata mula sa larawan, i-decrypt ang steganograpiya sa png, bmp, jpg."
  },
  "storeDesc": {
    "message": "Kailangan bang kunin ang mga lihim na mensahe na nakatago sa loob ng mga larawan na mukhang normal at hindi nakikita ang nakatagong nilalaman? Ang app na ito para sa dekoder at encoder ng steganograpiya ay tumutulong sa iyo na i-decode ang steganograpiya ng larawan sa loob ng ilang segundo, direkta sa iyong browser. Ito ay gumagana bilang isang dekoder ng steganograpiya para sa png/bmp/jpg/jpeg, kaya maaari mong kunin ang metadata at mga nakatagong mensahe ng steganograpiya mula sa mga screenshot, meme, o mga test na larawan nang hindi kinakailangang mag-install ng mabibigat na mga tool sa steganograpiya. Bukod dito, maaari mong isama ang mga hindi nakikitang lihim na data sa loob ng isang larawan.\n\n✅ Ano ang maaari mong gawin\n• kunin ang metadata mula sa larawan\n• ipakita ang mga larawan sa loob ng mga larawan\n• i-decrypt ang steganograpiya mula sa mga media file\n• i-decode ang steganograpiya sa iba't ibang format\n• kunin ang nakatagong impormasyon mula sa mga pixel\n• isama ang mga lihim na mensahe ng steganograpiya pabalik\n• itago ang teksto sa mga larawan gamit ang LSB steganograpiya\n• i-encode ang mensahe sa media file para sa pribadong pagbabahagi\n\n📌 Ang mga suportadong format ay kinabibilangan ng\n- png stegano decoder\n- bmp stegano decoder\n- jpg/jpeg stegano decoder\n\nPaano i-decode (mabilis na gabay)\n1️⃣ I-drop ang isang PNG/BMP/JPG/JPEG sa dekoder ng steganograpiya\n2️⃣ Awtomatikong pinoproseso nito ang mga larawan, kinukuha ang metadata at nagde-decrypt ng steganograpiya\n3️⃣ Kung kinakailangan, ulitin pagkatapos mag-save ng malinis na kopya\n\nPaano i-encode (mabilis na gabay)\n1️⃣ I-type ang iyong teksto o i-paste ang data\n2️⃣ Pumili ng isang PNG o BMP na larawan\n3️⃣ I-click ang isama at i-save ang iyong bagong file\n4️⃣ Ipadala ito tulad ng isang normal na larawan\n\n🧩 Para kanino ito\n▸ mga estudyanteng nag-aaral ng steganograpiya at mga batayang LSB\n▸ mga creator na nais itago ang mensahe sa png/bmp/jpg/jpeg\n▸ mga developer na mabilis na sumusubok ng tool sa steganograpiya ng larawan\n▸ mga manlalaro ng CTF na kailangang i-decrypt ang mga pahiwatig ng steganograpiya\n▸ mga mahilig sa steganograpiya\n\nBakit ginagamit ng mga tao ang software na ito sa steganograpiya\n➤ mabilis na pagsusuri sa mga chat, forum, o pananaliksik\n➤ isang malinis na tool sa steganograpiya na nananatiling magaan\n➤ isang maginhawang kombinasyon ng dekoder at encoder ng steganograpiya\n➤ kapaki-pakinabang kapag kailangan mong kunin ang mga lihim at i-validate ang mga file\n\n💡 Paano gumagana ang LSB (Least Significant Bit) steganograpiya\nBinabago ng LSB ang mga pinakamababang makabuluhang bit ng mga halaga ng kulay ng pixel upang isama ang lihim na payload. Dahil ang mga bit na ito ay may minimal na visual na epekto, ang larawan ay mukhang hindi nagbago sa mata ng tao. Ang aming tool sa steganograpiya ay pinoproseso ang mga file pixel sa pixel, nagbabasa o sumusulat ng data sa mga pinakamababang makabuluhang bit ng RGB channels. Ang pamamaraang ito ay partikular na epektibo sa mga format na PNG at BMP dahil gumagamit sila ng lossless compression, na nagpapanatili ng eksaktong mga halaga ng pixel na kinakailangan para sa maaasahang encoding at decoding ng steganograpiya.\n\n🔒 Isip sa privacy\nAng extension na Dekoder at Encoder ng Steganograpiya ay hindi nagbabahagi, nagse-save o nagpapadala ng anumang data mo saanman.\n\n📌 Mga suportadong pamamaraan\n\n1. dekoder ng steganograpiya png\n2. bmp stegano decoder para sa bitmap\n3. lsb stegano decoder logic para sa matatag, paulit-ulit na output\n4. lsb stegano png use cases para sa mga screenshot at icon\n5. suporta sa steganograpikong jpg/jpeg\n\n🛠️ Pagsusuri ng problema\n\n* gumamit ng orihinal na PNG/BMP kung posible (ang recompression ay maaaring makasira sa dekoder ng steganograpiya ng larawan)\n* kung nabigo ang decoding, subukan ang ibang kopya ng parehong file\n* panatilihing maliit ang mga mensahe para sa matatag na LSB encoding\n* iwasan ang pag-convert ng PNG sa JPG bago mo i-decrypt ang stego\n* ihambing ang mga output kapag nag-decode ka ng steganograpikong png pagkatapos ng pag-export\n\n⚡ Pagganap at mga limitasyon\nAng extension ay pinoproseso ang mga file nang buo sa iyong browser gamit ang Web APIs, na tinitiyak na ang iyong mga file ay hindi kailanman umaalis sa iyong device. Ang lokal na pagproseso na ito ay nangangahulugang walang pagkaantala sa pag-upload, walang mga dependency sa server, at kumpletong privacy. Ang bilis ng pagproseso ay nakasalalay sa laki ng file—ang maliliit na icon ay nag-de-decode sa loob ng ilang millisecond, habang ang mga high-resolution na larawan ay maaaring tumagal ng ilang segundo. Ang LSB na pamamaraan ay may limitasyon sa kapasidad: karaniwan mong maaring isama ang humigit-kumulang 1 byte ng data bawat 8 pixel sa isang uncompressed na larawan. Para sa pinakamahusay na resulta, gumamit ng uncompressed na mga format ng media at panatilihing maikli ang mga nakasamang mensahe. Tandaan na ang mga JPG file ay gumagamit ng lossy compression, na maaaring makasira sa nilalaman ng steganograpiya, kaya mas angkop ang mga ito para sa pag-decode ng umiiral na steganograpiya kaysa sa pag-encode ng mga bagong mensahe.\n\nFAQ\nQ: Anong mga format ang sinusuportahan ng tool na ito sa steganograpiya?\nA: Sinusuportahan namin ang png, bmp, jpeg, jpg. Maaaring idagdag ang mga bagong format sa hinaharap.\n\nQ: Anong pamamaraan ang ginagamit ng extension?\nA: Ito ay kumikilos bilang isang lsb na dekoder ng steganograpiya.\n\nQ: Ito ba ay online o offline?\nA: Hindi ito nangangailangan ng koneksyon kaya maaari itong gamitin sa parehong paraan.\n\nQ: Makakatulong ba ito sa akin na i-decode ang nakatagong mensahe?\nA: Oo, i-drop ang file sa extension at kukunin nito ang nakatagong impormasyon kung ito ay available."
  }
}