{
  "appName": {
    "message": "Steganográfiai Dekóder és Kódoló"
  },
  "shortDesc": {
    "message": "Használja az LSB képes steganográfiai dekóder és kódoló alkalmazást, hogy beágyazza vagy kinyerje a metaadatokat a képből, és dekódolja a steganográfiát png, bmp, jpg formátumban."
  },
  "storeDesc": {
    "message": "Titkos üzeneteket szeretnél kinyerni olyan képekből, amelyek teljesen normálisnak tűnnek, és a rejtett tartalom nem látható? Ez az lsb steganográfiai dekóder és kódoló alkalmazás segít a képek steganográfiájának dekódolásában másodpercek alatt, közvetlenül a böngésződben. PNG/BMP/JPG/JPEG formátumú képek steganográfiai dekóderként működik, így kinyerheted a metaadatokat és a rejtett steganográfiai üzeneteket képernyőképekből, mémekből vagy tesztképekből anélkül, hogy nehéz steganográfiai eszközöket kellene telepítened. Ezenkívül láthatatlan titkos adatokat is beágyazhatsz egy képbe.\n\n✅ Amit tehetsz\n• metaadatokat nyerhetsz ki a képből\n• képeket fedhetsz fel más képekben\n• dekódolhatod a steganográfiát médiafájlokból\n• különböző formátumú steganográfiát dekódolhatsz\n• rejtett információkat nyerhetsz ki a pixelekből\n• titkos steganográfiai üzeneteket ágyazhatsz vissza\n• szöveget rejthetsz el képekben LSB steganográfiával\n• üzenetet kódolhatsz médiafájlban privát megosztásra\n\n📌 Támogatott formátumok\n- png stego dekóder\n- bmp stego dekóder\n- jpg/jpeg stego dekóder\n\nHogyan dekódolj (gyors útmutató)\n1️⃣ Húzz be egy PNG/BMP/JPG/JPEG fájlt a steganográfiai dekóderbe\n2️⃣ Automatikusan elemzi a fényképeket, kinyeri a metaadatokat és dekódolja a steganográfiát\n3️⃣ Ha szükséges, futtasd újra egy tiszta másolat mentése után\n\nHogyan kódolj (gyors útmutató)\n1️⃣ Írd be a szöveget vagy másold be az adatokat\n2️⃣ Válassz egy PNG vagy BMP képet\n3️⃣ Kattints a beágyazásra és mentsd el az új fájlodat\n4️⃣ Küldd el, mint egy normál képet\n\n🧩 Kinek szól ez\n▸ diákoknak, akik a steganográfia dekódolását és az LSB alapjait tanulják\n▸ alkotóknak, akik üzenetet szeretnének elrejteni png/bmp/jpg/jpeg formátumban\n▸ fejlesztőknek, akik gyorsan tesztelni szeretnének egy képes steganográfiai eszközt\n▸ CTF játékosoknak, akiknek dekódolniuk kell a steganográfiai nyomokat\n▸ steganográfia rajongóknak\n\nMiért használják ezt a steganográfiai szoftvert az emberek\n➤ gyors ellenőrzések csevegésekben, fórumokon vagy kutatásokban\n➤ egy tiszta stego eszköz, amely könnyű marad\n➤ egy praktikus steganográfiai dekóder és kódoló kombináció\n➤ hasznos, amikor titkokat kell kinyerni és fájlokat érvényesíteni\n\n💡 Hogyan működik az LSB (Legkisebb Jelentőségű Bit) steganográfia\nAz LSB módosítja a pixel színértékek legkisebb jelentőségű bitjeit, hogy titkos terhelést ágyazzon be. Mivel ezeknek a biteknek minimális vizuális hatásuk van, a fénykép az emberi szem számára változatlannak tűnik. A stego eszközünk pixelről pixelre dolgozza fel a fájlokat, olvasva vagy írva az adatokat az RGB csatornák legkisebb jelentőségű biteibe. Ez a módszer különösen hatékony a PNG és BMP formátumokkal, mivel ezek veszteségmentes tömörítést használnak, megőrizve a megbízható steganográfiai kódoláshoz és dekódoláshoz szükséges pontos pixelértékeket.\n\n🔒 Adatvédelmi szemlélet\nA Steganográfiai Dekóder és Kódoló kiterjesztés nem osztja meg, nem menti el és nem küldi el az adataidat sehova.\n\n📌 Támogatott módszerek\n\n1. steganográfiai dekóder png\n2. bmp stego dekóder bitmaphoz\n3. lsb stego dekóder logika stabil, megismételhető kimenethez\n4. lsb stego png felhasználási esetek képernyőképekhez és ikonokhoz\n5. steganográfiai jpg/jpeg támogatás\n\n🛠️ Hibaelhárítás\n\n* lehetőség szerint használd az eredeti PNG/BMP fájlt (a tömörítés megszakíthatja a steganográfiai kép dekóder működését)\n* ha a dekódolás nem sikerül, próbálj meg egy másik másolatot ugyanabból a fájlból\n* tartsd a üzeneteket kicsinek a stabil LSB kódolás érdekében\n* kerüld a PNG JPG-ra való konvertálását, mielőtt dekódolnád a stegot\n* hasonlítsd össze a kimeneteket, amikor steganográfiai png-t dekódolsz exportálás után\n\n⚡ Teljesítmény és korlátozások\nA kiterjesztés teljes mértékben a böngésződben dolgozza fel a fájlokat Web API-k használatával, biztosítva, hogy a fájljaid soha ne hagyják el az eszközödet. Ez a helyi feldolgozás azt jelenti, hogy nincs feltöltési késedelem, nincs szerverfüggőség, és teljes adatvédelem. A feldolgozási sebesség a fájl méretétől függ - a kis ikonok milliszekundumok alatt dekódolódnak, míg a nagy felbontású fényképek néhány másodpercet vehetnek igénybe. Az LSB módszernek van egy kapacitási korlátja: általában körülbelül 1 byte adat ágyazható be 8 pixelbe egy tömörítetlen fényképben. A legjobb eredmények érdekében használj tömörítetlen médiaformátumokat, és tartsd az ágyazott üzeneteket tömören. Ne feledd, hogy a JPG fájlok veszteséges tömörítést használnak, ami tönkreteheti a steganográfiai tartalmat, ezért jobban alkalmasak a meglévő steganográfia dekódolására, mint új üzenetek kódolására.\n\nGYIK\nK: Milyen formátumokat támogat ez a steganográfiai eszköz?\nV: Támogatjuk a png, bmp, jpeg, jpg formátumokat. Új formátumok a jövőben hozzáadhatók.\n\nK: Milyen módszert használ a kiterjesztés?\nV: LSB steganográfiai dekóderként viselkedik.\n\nK: Online vagy offline?\nV: Nem igényel kapcsolatot, így mindkét módon használható.\n\nK: Segíthet nekem dekódolni a rejtett üzenet szöveget?\nV: Igen, húzd be a fájlt a kiterjesztésbe, és kinyeri a rejtett információt, ha az elérhető."
  }
}