{
  "appName": {
    "message": "Αποκωδικοποιητής και Κωδικοποιητής Στεγανότητας"
  },
  "shortDesc": {
    "message": "Χρησιμοποιήστε την εφαρμογή Αποκωδικοποιητής και Κωδικοποιητής Στεγανότητας για να ενσωματώσετε ή να εξαγάγετε μεταδεδομένα από εικόνα, να αποκρυπτογραφήσετε στεγανότητα σε png, bmp, jpg."
  },
  "storeDesc": {
    "message": "Χρειάζεστε να εξάγετε μυστικά μηνύματα κρυμμένα μέσα σε εικόνες που φαίνονται εντελώς φυσιολογικές και το κρυφό περιεχόμενο δεν είναι ορατό; Αυτή η εφαρμογή αποκωδικοποιητή και κωδικοποιητή στεγανότητας lsb σας βοηθά να αποκωδικοποιήσετε την εικόνα στεγανότητας σε δευτερόλεπτα, απευθείας στον περιηγητή σας. Λειτουργεί ως αποκωδικοποιητής εικόνας στεγανότητας για png/bmp/jpg/jpeg, ώστε να μπορείτε να εξάγετε μεταδεδομένα και κρυμμένα στεγανικά μηνύματα από στιγμιότυπα οθόνης, memes ή δοκιμαστικές εικόνες χωρίς να εγκαταστήσετε βαριά εργαλεία στεγανότητας. Επιπλέον, μπορείτε να ενσωματώσετε αόρατα μυστικά δεδομένα μέσα σε μια εικόνα.\n\n✅ Τι μπορείτε να κάνετε\n• εξαγωγή μεταδεδομένων από εικόνα\n• αποκάλυψη εικόνων μέσα σε εικόνες\n• αποκρυπτογράφηση στεγανότητας από αρχεία πολυμέσων\n• αποκωδικοποίηση στεγανότητας σε διάφορες μορφές\n• εξαγωγή κρυφών πληροφοριών από εικονοστοιχεία\n• ενσωμάτωση μυστικών στεγανικών μηνυμάτων πίσω\n• απόκρυψη κειμένου σε εικόνες με στεγανότητα LSB\n• κωδικοποίηση μηνύματος σε αρχείο πολυμέσων για ιδιωτική κοινοποίηση\n\n📌 Υποστηριζόμενες μορφές περιλαμβάνουν\n- αποκωδικοποιητής stegano png\n- αποκωδικοποιητής stegano bmp\n- αποκωδικοποιητής stegano jpg/jpeg\n\nΠώς να αποκωδικοποιήσετε (γρήγορος οδηγός)\n1️⃣ Ρίξτε ένα PNG/BMP/JPG/JPEG στον αποκωδικοποιητή στεγανότητας\n2️⃣ Αυτόματα αναλύει τις φωτογραφίες, εξάγει μεταδεδομένα και αποκρυπτογραφεί τη στεγανότητα\n3️⃣ Αν χρειαστεί, εκτελέστε ξανά μετά την αποθήκευση μιας καθαρής αντιγράφου\n\nΠώς να κωδικοποιήσετε (γρήγορος οδηγός)\n1️⃣ Πληκτρολογήστε το κείμενό σας ή επικολλήστε δεδομένα\n2️⃣ Επιλέξτε μια εικόνα PNG ή BMP\n3️⃣ Κάντε κλικ στην ενσωμάτωση και αποθηκεύστε το νέο σας αρχείο\n4️⃣ Στείλτε το όπως μια κανονική εικόνα\n\n🧩 Για ποιον είναι αυτό\n▸ φοιτητές που μαθαίνουν τα βασικά της αποκωδικοποίησης στεγανότητας και LSB\n▸ δημιουργοί που θέλουν να κρύψουν μηνύματα σε png/bmp/jpg/jpeg\n▸ προγραμματιστές που δοκιμάζουν γρήγορα ένα εργαλείο στεγανότητας εικόνας\n▸ παίκτες CTF που χρειάζονται να αποκρυπτογραφήσουν υποδείξεις στεγανότητας\n▸ ενθουσιώδεις της στεγανότητας\n\nΓιατί οι άνθρωποι χρησιμοποιούν αυτό το λογισμικό στεγανότητας\n➤ γρήγοροι έλεγχοι σε συνομιλίες, φόρουμ ή έρευνες\n➤ ένα καθαρό εργαλείο stegano που παραμένει ελαφρύ\n➤ ένας βολικός συνδυασμός αποκωδικοποιητή και κωδικοποιητή στεγανότητας\n➤ χρήσιμο όταν πρέπει να εξάγετε μυστικά και να επικυρώσετε αρχεία\n\n💡 Πώς λειτουργεί η στεγανότητα LSB (Least Significant Bit)\nΗ LSB τροποποιεί τα λιγότερο σημαντικά bits των τιμών χρώματος των εικονοστοιχείων για να ενσωματώσει μυστικό φορτίο. Δεδομένου ότι αυτά τα bits έχουν ελάχιστο οπτικό αντίκτυπο, η φωτογραφία φαίνεται αμετάβλητη στο ανθρώπινο μάτι. Το εργαλείο μας επεξεργάζεται τα αρχεία pixel προς pixel, διαβάζοντας ή γράφοντας δεδομένα στα λιγότερο σημαντικά bits των καναλιών RGB. Αυτή η μέθοδος είναι ιδιαίτερα αποτελεσματική με τις μορφές PNG και BMP επειδή χρησιμοποιούν χωρίς απώλειες συμπίεση, διατηρώντας τις ακριβείς τιμές των εικονοστοιχείων που απαιτούνται για αξιόπιστη κωδικοποίηση και αποκωδικοποίηση στεγανότητας.\n\n🔒 Νοοτροπία απορρήτου\nΟ αποκωδικοποιητής και κωδικοποιητής στεγανότητας δεν μοιράζεται, αποθηκεύει ή στέλνει κανένα από τα δεδομένα σας οπουδήποτε.\n\n📌 Υποστηριζόμενες μέθοδοι\n\n1. αποκωδικοποιητής στεγανότητας png\n2. αποκωδικοποιητής stegano bmp για bitmap\n3. λογική αποκωδικοποιητή lsb stegano για σταθερή, επαναλαμβανόμενη έξοδο\n4. περιπτώσεις χρήσης lsb stegano png για στιγμιότυπα οθόνης και εικονίδια\n5. υποστήριξη στεγανικών jpg/jpeg\n\n🛠️ Αντιμετώπιση προβλημάτων\n\n* χρησιμοποιήστε το αρχικό PNG/BMP όταν είναι δυνατόν (η επανασυμπίεση μπορεί να σπάσει τον αποκωδικοποιητή εικόνας στεγανότητας)\n* αν η αποκωδικοποίηση αποτύχει, δοκιμάστε μια άλλη αντίγραφο του ίδιου αρχείου\n* κρατήστε τα μηνύματα μικρά για σταθερή κωδικοποίηση LSB\n* αποφύγετε τη μετατροπή PNG σε JPG πριν αποκρυπτογραφήσετε το stego\n* συγκρίνετε τις εξόδους όταν αποκωδικοποιείτε στεγανική png μετά την εξαγωγή\n\n⚡ Απόδοση και περιορισμοί\nΗ επέκταση επεξεργάζεται τα αρχεία εξ ολοκλήρου στον περιηγητή σας χρησιμοποιώντας Web APIs, διασφαλίζοντας ότι τα αρχεία σας δεν φεύγουν ποτέ από τη συσκευή σας. Αυτή η τοπική επεξεργασία σημαίνει ότι δεν υπάρχουν καθυστερήσεις μεταφόρτωσης, καμία εξάρτηση από διακομιστές και πλήρης ιδιωτικότητα. Η ταχύτητα επεξεργασίας εξαρτάται από το μέγεθος του αρχείου—μικρές εικονίδια αποκωδικοποιούνται σε χιλιοστά του δευτερολέπτου, ενώ οι φωτογραφίες υψηλής ανάλυσης μπορεί να διαρκέσουν μερικά δευτερόλεπτα. Η μέθοδος LSB έχει όριο χωρητικότητας: μπορείτε συνήθως να ενσωματώσετε περίπου 1 byte δεδομένων ανά 8 εικονοστοιχεία σε μια φωτογραφία χωρίς συμπίεση. Για καλύτερα αποτελέσματα, χρησιμοποιήστε μη συμπιεσμένες μορφές πολυμέσων και κρατήστε τα ενσωματωμένα μηνύματα συνοπτικά. Θυμηθείτε ότι τα αρχεία JPG χρησιμοποιούν συμπίεση με απώλειες, η οποία μπορεί να καταστρέψει το στεγανικό περιεχόμενο, επομένως είναι καλύτερα κατάλληλα για αποκωδικοποίηση υπάρχουσας στεγανότητας παρά για κωδικοποίηση νέων μηνυμάτων.\n\nFAQ\nΕ: Ποιες μορφές υποστηρίζει αυτό το εργαλείο στεγανότητας;\nΑ: Υποστηρίζουμε png, bmp, jpeg, jpg. Νέες μορφές μπορεί να προστεθούν στο μέλλον.\n\nΕ: Ποια μέθοδο χρησιμοποιεί η επέκταση;\nΑ: Συμπεριφέρεται ως αποκωδικοποιητής στεγανότητας lsb.\n\nΕ: Είναι online ή offline;\nΑ: Δεν απαιτεί σύνδεση, επομένως μπορεί να χρησιμοποιηθεί και με τους δύο τρόπους.\n\nΕ: Μπορεί να με βοηθήσει να αποκωδικοποιήσω κρυφό κείμενο μηνύματος;\nΑ: Ναι, ρίξτε το αρχείο στην επέκταση και θα εξάγει κρυφές πληροφορίες αν είναι διαθέσιμες."
  }
}