{
  "appName": {
    "message": "Steganographie Decoder & Encoder"
  },
  "shortDesc": {
    "message": "Verwenden Sie die Steganographie Decoder & Encoder-App, um Metadaten aus Bildern einzubetten oder zu extrahieren, und um Steganographie in png, bmp, jpg zu entschlüsseln."
  },
  "storeDesc": {
    "message": "Müssen Sie geheime Nachrichten extrahieren, die in Bildern versteckt sind, die völlig normal aussehen und deren versteckter Inhalt nicht sichtbar ist? Diese LSB Steganographie Decoder & Encoder App hilft Ihnen, Bildsteganographie in Sekunden zu dekodieren, direkt in Ihrem Browser. Sie funktioniert als Bildsteganographie-Decoder für PNG/BMP/JPG/JPEG, sodass Sie Metadaten und versteckte steganographische Nachrichten aus Screenshots, Memes oder Testbildern extrahieren können, ohne schwere Steganographie-Tools installieren zu müssen. Darüber hinaus können Sie unsichtbare geheime Daten in ein Bild einbetten.\n\n✅ Was Sie tun können\n• Metadaten aus Bildern extrahieren\n• Bilder innerhalb von Bildern enthüllen\n• Steganographie aus Mediendateien entschlüsseln\n• Steganographie in verschiedenen Formaten dekodieren\n• Verborgene Informationen aus Pixeln extrahieren\n• Geheime steganographische Nachrichten zurück einbetten\n• Text in Bildern mit LSB Steganographie verstecken\n• Nachricht in Mediendatei für private Weitergabe kodieren\n\n📌 Unterstützte Formate sind\n- PNG Stegano-Decoder\n- BMP Stegano-Decoder\n- JPG/JPEG Stegano-Decoder\n\nSo dekodieren Sie (schnelle Anleitung)\n1️⃣ Ziehen Sie ein PNG/BMP/JPG/JPEG in den Steganographie-Decoder\n2️⃣ Er verarbeitet automatisch Fotos, extrahiert Metadaten und entschlüsselt Steganographie\n3️⃣ Falls nötig, erneut ausführen, nachdem Sie eine saubere Kopie gespeichert haben\n\nSo kodieren Sie (schnelle Anleitung)\n1️⃣ Geben Sie Ihren Text ein oder fügen Sie Daten ein\n2️⃣ Wählen Sie ein PNG- oder BMP-Bild aus\n3️⃣ Klicken Sie auf Einbetten und speichern Sie Ihre neue Datei\n4️⃣ Senden Sie es wie ein normales Bild\n\n🧩 Für wen das gedacht ist\n▸ Studenten, die Steganographie dekodieren und die Grundlagen der LSB lernen\n▸ Kreative, die Nachrichten in PNG/BMP/JPG/JPEG verstecken möchten\n▸ Entwickler, die ein Bildsteganographie-Tool schnell testen möchten\n▸ CTF-Spieler, die Steganographie-Hinweise entschlüsseln müssen\n▸ Steganographie-Enthusiasten\n\nWarum Menschen diese Steganographie-Software verwenden\n➤ schnelle Überprüfungen in Chats, Foren oder Recherchen\n➤ ein sauberes Stegano-Tool, das leicht bleibt\n➤ eine praktische Kombination aus steganographischem Decoder und Encoder\n➤ nützlich, wenn Sie Geheimnisse extrahieren und Dateien validieren müssen\n\n💡 Wie LSB (Least Significant Bit) Steganographie funktioniert\nLSB ändert die am wenigsten signifikanten Bits der Farbwerte von Pixeln, um geheime Daten einzubetten. Da diese Bits minimale visuelle Auswirkungen haben, sieht das Foto für das menschliche Auge unverändert aus. Unser Steg-Tool verarbeitet Dateien pixelweise, indem es Daten in den am wenigsten signifikanten Bits der RGB-Kanäle liest oder schreibt. Diese Methode ist besonders effektiv bei PNG- und BMP-Formaten, da sie verlustfreie Kompression verwenden, die die genauen Pixelwerte für zuverlässige Steganographie-Kodierung und -Dekodierung bewahrt.\n\n🔒 Datenschutz\nDie Steganographie Decoder & Encoder Erweiterung teilt, speichert oder sendet keine Ihrer Daten irgendwohin.\n\n📌 Unterstützte Methoden\n\n1. Steganographie-Decoder PNG\n2. BMP Stegano-Decoder für Bitmap\n3. LSB Stegano-Decoder-Logik für stabile, wiederholbare Ausgaben\n4. LSB Stegano PNG-Anwendungsfälle für Screenshots und Icons\n5. Steganographische JPG/JPEG-Unterstützung\n\n🛠️ Fehlersuche\n\n* Verwenden Sie, wenn möglich, das Original-PNG/BMP (Rekompression kann den Steganographie-Bilddecoder beschädigen)\n* Wenn das Dekodieren fehlschlägt, versuchen Sie eine andere Kopie derselben Datei\n* Halten Sie Nachrichten klein für stabile LSB-Kodierung\n* Vermeiden Sie es, PNG vor der Dekodierung von Stego in JPG zu konvertieren\n* Vergleichen Sie die Ausgaben, wenn Sie steganographisches PNG nach dem Exportieren dekodieren\n\n⚡ Leistung und Einschränkungen\nDie Erweiterung verarbeitet Dateien vollständig in Ihrem Browser unter Verwendung von Web-APIs, sodass Ihre Dateien Ihr Gerät niemals verlassen. Diese lokale Verarbeitung bedeutet keine Upload-Verzögerungen, keine Serverabhängigkeiten und vollständige Privatsphäre. Die Verarbeitungsgeschwindigkeit hängt von der Dateigröße ab – kleine Icons werden in Millisekunden dekodiert, während hochauflösende Fotos einige Sekunden in Anspruch nehmen können. Die LSB-Methode hat eine Kapazitätsgrenze: Sie können typischerweise etwa 1 Byte Daten pro 8 Pixel in einem unkomprimierten Foto einbetten. Für die besten Ergebnisse verwenden Sie unkomprimierte Medienformate und halten Sie eingebettete Nachrichten prägnant. Denken Sie daran, dass JPG-Dateien verlustbehaftete Kompression verwenden, die den steganographischen Inhalt beschädigen kann, sodass sie besser zum Dekodieren vorhandener Steganographie geeignet sind als zum Kodieren neuer Nachrichten.\n\nFAQ\nF: Welche Formate unterstützt dieses Steganographie-Tool?\nA: Wir unterstützen PNG, BMP, JPEG, JPG. Neue Formate können in Zukunft hinzugefügt werden.\n\nF: Welche Methode verwendet die Erweiterung?\nA: Sie verhält sich wie ein LSB Steganographie-Decoder.\n\nF: Ist es online oder offline?\nA: Es benötigt keine Verbindung, sodass es auf beide Arten verwendet werden kann.\n\nF: Kann es mir helfen, versteckte Nachrichtentexte zu dekodieren?\nA: Ja, ziehen Sie die Datei in die Erweiterung, und sie wird verborgene Informationen extrahieren, wenn sie verfügbar sind."
  }
}